[
    {
        "ItemCode": "JAN100374",
        "ReleaseDate": "In Shops: Jun 23, 2010",
        "Title": "TWO FLOWERS FOR THE DRAGON VOL 06",
        "SRP": "SRP: $9.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Nari Kusakawa (A/CA) Nari Kusakawa",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411413?type=1",
        "Text": "Written and illustrated by Nari Kusakawa<br/> CMX. Already reeling from a devastating betrayal, Shakuya loses her powers just when the evil Master of the Sand makes his move! She and her friends barely escape from the underground complex before it collapses. Meanwhile, Kuwan has disappeared and taken the Dragon Orb with him! It's up to Lucien-her other fiancé-to try and reignite her dragon powers in time to save the day!<br/>"
    },
    {
        "ItemCode": "JAN100373",
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "Title": "NAME OF THE FLOWER VOL 04",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411415?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Ken Saito (A/CA) Ken Saito",
        "SRP": "SRP: $9.99",
        "Text": "Written and illustrated by Ken Saito<br/> CMX. Final volume! While Kei is avoiding Chouko, he receives some important news about one of his books. Meanwhile, Chouko's busy with the literature club at school. Then she discovers that her grandfather is gravely ill and that she needs to be by his side. With relations strained, signals crossed, and other matters proving to be distracting, will this couple ever get to live happily ever after?<br/>"
    },
    {
        "ItemCode": "JAN100372",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "FIRE INVESTIGATOR NANASE VOL 04",
        "SRP": "SRP: $9.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Izo Hashimoto (A/CA) Tomoshige Ichikawa",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411412?type=1",
        "Text": "Story by Izo HASHIMOTO<br/> Art by Tomoshige ICHIKAWA<br/> CMX. In the conclusion of \"Trial By Fire,\" a dream brings up a repressed memory for Nanase concerning the night her house burned down. Soon, she's on another arson case that revolves around a very broken family. And when a bank goes up in flames, it seems the perpetrator might be tied directly to the infamous arsonist, Firebug. Will their connection finally reveal the master arsonist's identity?<br/>"
    },
    {
        "ItemCode": "JAN100371",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "CRAYON SHINCHAN VOL 11 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411411?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Yoshito Usui (A) Yoshito Usui",
        "SRP": "SRP: $7.99",
        "Text": "Written and illustrated by Yoshito Usui<br/> CMX. Only Shinnosuke could open up a doorway to the past by digging a hole in the yard! The Noharas find themselves transported back to Japan's Civil War Era, in the middle of a castle siege. A guy by the name of Stinkpoop is out to kidnap a princess in exchange for a valuable scroll. It's up to Shin and his family to save the day! Will their actions in the past turn the present into a big mess?<br/>"
    },
    {
        "ItemCode": "JAN100370",
        "ReleaseDate": "In Shops: May 05, 2010",
        "Title": "BROKEN BLADE VOL 03",
        "SRP": "SRP: $9.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Yunosuke Yoshinaga (A/CA) Yunosuke Yoshinaga",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411410?type=1",
        "Text": "Written and illustrated by Yunosuke Yoshinaga<br/> CMX/FLEX COMIX. Rygart deals with his guilt over the death of Dan, the Golem pilot. Later, he's sworn in as part of the Krisna army and his own Golem is outfitted with a new, external armor. Outside of the city, Zess' unit sets up camp and plots its next move. Cleo wants revenge against Rygart, who she believes is responsible for Lee's death. But first Rygart has to go up against his friend Zess.<br/>"
    },
    {
        "ItemCode": "JAN100369",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "DIAMOND GIRL VOL 01",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411409?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Takanori Yamazaki (A/CA) Takanori Yamazaki",
        "SRP": "SRP: $9.99",
        "Text": "Written and illustrated by Takanori Yamazaki<br/> CMX/FLEX COMIX. Tsubura has just moved to the countryside and is ready for some peace and quiet. At her new school, all she wants is to blend in. But when an errant ball shatters through her classroom window and she springs into action, Tsubura reveals her hidden talent for baseball. The school team is determined to get her to join and help to transform them from the worst to the best. No one really understands why Tsubura hates the sport, but their efforts to recruit her might just drive her away.<br/>"
    },
    {
        "ItemCode": "JAN100366",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "UNKNOWN SOLDIER #18 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Joshua Dysart (A) Alberto Ponticelli (CA) Dave Johnson",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411284?type=1",
        "Text": "Written by JOSHUA DYSART<br/> Art by ALBERTO PONTICELLI  <br/> Cover by DAVE JOHNSON<br/> With the doctor's killer revealed, Moses is dragged deeper into his own psychosis than ever before, making it more and more difficult to keep it cool as he plots the violent takedown of every enemy he's made while in the IDP camp.<br/>"
    },
    {
        "ItemCode": "JAN100365",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "UNWRITTEN #11 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411285?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Mike Carey (A) Jimmy Broxton, Peter Gross (CA) Yuko Shimizu",
        "SRP": "SRP: $2.99",
        "Text": "Written by MIKE CAREY <br/> Art by PETER GROSS &amp; JIMMY BROXTON <br/> Cover by YUKO SHIMIZU <br/> In a city haunted by its own past, Tom Taylor tries to help a very different kind of tormented ghost - and discovers the many ways the dead can threaten the living.<br/>"
    },
    {
        "ItemCode": "JAN100364",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "SWEET TOOTH #7 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Jeff Lemire (A/CA) Jeff Lemire",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411280?type=1",
        "Text": "Written by JEFF LEMIRE<br/> Art and cover by JEFF LEMIRE <br/> As Jepperd hits rock bottom, memories of his chilling past resurface. And Gus finally comes face-to-face with the ominous Dr. Singh, a man at the center of the post-apocalyptic mystery.<br/>"
    },
    {
        "ItemCode": "JAN100362",
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "Title": "SANDMAN MYSTERY THEATRE TP VOL 08",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411407?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Steven T. Seagle, Matt Wagner (A) Guy Davis, Matthew Dow Smith, Richard Case, Daniel Torres (CA) Gavin Wilson",
        "SRP": "SRP: $19.99",
        "Text": "Written by MATT WAGNER and STEVEN T. SEAGLE <br/> Art by MATT SMITH, GUY DAVIS &amp; others <br/> Cover by GAVIN WILSON &amp; RICHARD BRUNING<br/> In the latest SMT collection, featuring issues #45-52, Wesley Dodds encounters a brash young pilot called Blackhawk and enters the seedy world of pulp publishing.<br/>"
    },
    {
        "ItemCode": "JAN100361",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "SCALPED #36 (RES) ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Jason Aaron (A) Davide Furn? (CA) Jock",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK409500?type=1",
        "Text": "On sale February 17 <li>32 pg, FC, $2.99 US </li><li>MATURE READERS<br/> Written by Jason Aaron </li><li>Art by Davide Furno </li><li>Cover by Jock<br/> Beginning a brand-new arc focusing on one of the reservation's most mysterious characters: Red Crow's right-hand man, Shunka. When Red Crow becomes embroiled in a feud with a rival Native American casino, Shunka is sent to sort out the mess... <br/>"
    },
    {
        "ItemCode": "JAN100360",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "NORTHLANDERS #26 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411263?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Brian Wood (A) Leandro Fernandez (CA) Massimo Carnevale",
        "SRP": "SRP: $2.99",
        "Text": "<li>Written by BRIAN WOOD   Art by LEANDRO FERNANDEZ<br/> Cover by MASSIMO CARNEVALE<br/> \"The Plague Widow\" part 6 of 8. The settlement, driven half into the ground by crushing isolation and starvation, suffers anew in the brutal hands of Gunborg. Hilda, having been spared much of the recent violence, realizes her survival wasn't by chance, and what she is expected to pay in return is unthinkable. <br/>"
    },
    {
        "ItemCode": "JAN100359",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "MADAME XANADU #21 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Matt Wagner (A/CA) Amy Reeder-Hadley",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411259?type=1",
        "Text": "Written by MATT WAGNER <br/> Art by AMY REEDER HADLEY &amp; RICHARD FRIEND <br/> Cover by AMY REEDER HADLEY<br/> Madame Xanadu and her stark, raving mad sister Morgana are still at odds, leaving 1950s housewife Betty Reynolds more distraught - and more inhuman - than ever.  And Mr. Jones continues his \"negotiations\" with the New York mob in an effort to aid and abet Madame Xanadu's investigation.<br/>"
    },
    {
        "ItemCode": "JAN100358",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "HOUSE OF MYSTERY #23 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411248?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Matthew Sturges (A) Sam Kieth, Luca Rossi (CA) Esao Andrews",
        "SRP": "SRP: $2.99",
        "Text": "Written by MATTHEW STURGES <br/> Art by LUCA ROSSI &amp; SAM KIETH<br/> Cover by ESAO ANDREWS<br/> Here's Fig, waking up in bed with someone she'd much rather not wake up with. This, of course, leads to an unpleasant and bloody confrontation. What happens when one of the House of Mystery residents tries to kill another? Featuring an urban fairy tale illustrated by Sam Kieth (THE MAXX).<br/>"
    },
    {
        "ItemCode": "JAN100357",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "HELLBLAZER #265 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Peter Milligan (A/CA) Simon Bisley",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411247?type=1",
        "Text": "Written by PETER MILLIGAN <br/> Art and cover by SIMON BISLEY<br/> In this new 2-part storyline, Constantine reluctantly becomes embroiled in a group of anarcho punks who worship a powerful effigy of Sid Vicious. Complicating matters further is an alchemist and a violent group of extreme political fixers. Featuring guest art by Simon Bisley!<br/>"
    },
    {
        "ItemCode": "JAN100356",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "JOE THE BARBARIAN #3 (OF 8) ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411251?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Grant Morrison (A) Sean Murphy",
        "SRP": "SRP: $2.99",
        "Text": "Written by GRANT MORRISON<br/> Art and cover by SEAN MURPHY <br/> What menace lurks within the midget submarines of Crater Fjord? What is the shocking secret of The Dying Boy? And what part must Joe play in the prophecies of the threatened Kingdom? All this and Smoot, the world's biggest dwarf, in the latest chapter of this epic adventure of a boy and his rat.<br/>"
    },
    {
        "ItemCode": "JAN100355",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "JACK OF FABLES #44 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Matthew Sturges, Bill Willingham (A) Tony Akins, Jim Fern (CA) Brian Bolland",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411250?type=1",
        "Text": "Written by BILL WILLINGHAM &amp; MATTHEW STURGES <br/> Art by TONY AKINS &amp; ANDREW PEPOY <br/> Cover by BRIAN BOLLAND<br/> Jack Frost and his stalwart owl companion MacDuff take to the skies as Jack's quest to save a kingdom from the vicious Empyrean nears its conclusion. We hope you like robot attack birds, rayguns and space elevators cause we have it all! Plus, Babe the Miniature Blue Ox: philosopher, poet, hero.<br/>"
    },
    {
        "ItemCode": "JAN100354",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "CINDERELLA FROM FABLETOWN WITH LOVE #5 (OF 6) ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411228?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Chris Roberson (A) Shawn McManus",
        "SRP": "SRP: $2.99",
        "Text": "Written by CHRIS ROBERSON <br/> Art by SHAWN MCMANUS<br/> Cover by CHRISSIE ZULLO<br/> The search for the source of the black market magics takes Cinderella and Aladdin to the Fables homeland of Ultima Thule where the fall of the Adversary's Empire has led to a bloody revolution. Back in Fabletown, Crispin Cordwainer's new shoe designs inspire a threat from Sheriff Beast.<br/>"
    },
    {
        "ItemCode": "JAN100353",
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "Title": "FABLES #94 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Bill Willingham (A) Mark Buckingham (CA) Joao Ruas",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411237?type=1",
        "Text": "Written by BILL WILLINGHAM<br/> Art by MARK BUCKINGHAM &amp; STEVE LEIALOHA <br/> Cover by JOAO RUAS <br/> In this new storyline, Rose Red has finally hit rock bottom. Does she stay there or start the long, tortuous climb back up? We're hoping for the latter, since this new arc is named after her, and we wouldn't have much of a story without her. The Farm is in chaos, as many factions compete to fill the void of her missing leadership. And there's a big magical fight brewing down in the town square, right under her window.<br/>"
    },
    {
        "ItemCode": "JAN100352",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "GREEK STREET #9 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411242?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Peter Milligan (A) Davide Gianfelice (CA) Davide Furn?",
        "SRP": "SRP: $2.99",
        "Text": "Written by PETER MILLIGAN <br/> Art by DAVIDE GIANFELICE<br/> Cover by DAVIDE FURNO<br/> Terror, madness and the downright irrational collide as the war between the Fureys and the Chinese takes an unexpected turn. Meanwhile, after escaping Calypso and her pornsters, Eddie and Sandy finally meet their possible savior.<br/>"
    },
    {
        "ItemCode": "JAN100351",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "DMZ #51 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Brian Wood (A) Riccardo Burchielli (CA) John Paul Leon",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411234?type=1",
        "Text": "Written by BRIAN WOOD<br/> Art by RICCARDO BURCHIELLI<br/> Cover by JP LEON<br/> After the shattering events of issue #49, we start to pick up the pieces with \"M.I.A.\", a four-part story taking Matty to a remote and desolate section of the city. With no phone, no computer and no contact at all with any of his friends, what exactly is he doing there, and why?<br/>"
    },
    {
        "ItemCode": "JAN100350",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "DEMO VOL 2 #2 (OF 6) ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411232?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Brian Wood (A/CA) Becky Cloonan",
        "SRP": "SRP: $2.99",
        "Text": "Written by BRIAN WOOD<br/> Art and cover by BECKY CLOONAN <br/> The acclaimed series packed with a self-contained story in each issue continues with a shockingly dark tale titled \"Pangs!\" Frank's rail-thin, barely eats, lives alone, pukes at the smell of breakfast, works in an office full of idiots, avoids lunch, hates chicken, hates seafood, hates socializing... He's completely unlike the woman at work he's becoming obsessed with. Despite all that, though, find out just how disturbingly far Frank will go to win her heart.<br/>"
    },
    {
        "ItemCode": "JAN100349",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "AIR #19 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) G. Willow Wilson (A/CA) M. K. Perker",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411206?type=1",
        "Text": "Written by G. WILLOW WILSON <br/> Art and cover by M.K. PERKER<br/> On the hunt for a 100-year-old suitcase, the team ends up in St. Petersburg during their first solo mission in the hyperprax test plane. Tired of having her destiny dictated to her, Blythe decides to take the future into her own hands. <br/>"
    },
    {
        "ItemCode": "JAN100348",
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "Title": "100 PERCENT TP ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411406?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Paul Pope (A/CA) Paul Pope",
        "SRP": "SRP: $29.99",
        "Text": "Written by PAUL POPE <br/> Art and cover by PAUL POPE<br/> The  edgy, groundbreaking epic from visionary creator Paul Pope is now available in paperback! Collecting all five issues of the hard-hitting miniseries that takes a peek inside a cyberpunk vision of the year 2038, this new volume includes a host of never-before-seen material previously only available in the HC.<br/>"
    },
    {
        "ItemCode": "JAN100347",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "DAYTRIPPER #4 (OF 10) ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Gabriel B?, F?bio Moon (A/CA) Gabriel B?, F?bio Moon",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411230?type=1",
        "Text": "Written by FÁBIO MOON &amp; GABRIEL BÁ<br/> Art by GABRIEL BÁ &amp; FÁBIO MOON <br/> Cover by GABRIEL BÁ <br/> \"Honest and arousing, everything about Fabio Moon's artwork is sexy - even when it's dirty and lonely. Once I started reading DAYTRIPPER, I couldn't put it down!\"- Jeff Smith (Bone)<br/> It's a day of celebration as Brás' son is born! But why is Brás' mother at the hospital before him? And when it comes to his family getting bigger, why might he not want to welcome all its new members?<br/>"
    },
    {
        "ItemCode": "JAN100346",
        "ReleaseDate": "In Shops: May 19, 2010",
        "Title": "EXECUTOR HC ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411405?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Jon Evans (A) Andrea Mutti (CA) Lee Bermejo",
        "SRP": "SRP: $19.99",
        "Text": "Written by JON EVANS<br/> Art by ANDREA MUTTI<br/> Cover by LEE BERMEJO<br/> New from Vertigo Crime, THE EXECUTOR is the story of Joseph Ullen, a retired pro athlete, who returns to his hometown in upstate New York when he's named executor of his high-school sweetheart's will. In a search to find out what really happened to Miriam following her mysterious death, Joseph is confronted with his own haunted past and the possibility that the two are connected.<br/>"
    },
    {
        "ItemCode": "JAN100345",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "AMERICAN VAMPIRE #1 VAR ED ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Scott Snyder (A) Rafael Albuquerque (CA) Jim Lee",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411404?type=1",
        "Text": "Written by SCOTT SNYDER &amp; STEPHEN KING <br/> Art and cover by RAFAEL ALBUQUERQUE<br/> 1:25 Variant cover by JIM LEE<br/> Witness the birth of a brand new species of vampire in this new ongoing series that begins with five extra-sized issues featuring back-to-back stories by exciting new writer Scott Snyder and the master of horror himself, Stephen King! When notorious outlaw Skinner Sweet is attacked by an old enemy (who happens to be a member of the undead), the first American vampire is born... a vampire powered by the sun, stronger, fiercer, and meaner than anything that came before. Plus... Pearl Jones is a struggling young actress in 1920s Los Angeles. But when her big break brings her face-to-face with an ancient evil, her Hollywood dream quickly turns into a brutal, shocking nightmare.<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100344",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "AMERICAN VAMPIRE #1 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411403?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Scott Snyder (A/CA) Rafael Albuquerque",
        "SRP": "SRP: $3.99",
        "Text": "Written by SCOTT SNYDER &amp; STEPHEN KING <br/> Art and cover by RAFAEL ALBUQUERQUE<br/> 1:25 Variant cover by JIM LEE<br/> Witness the birth of a brand new species of vampire in this new ongoing series that begins with five extra-sized issues featuring back-to-back stories by exciting new writer Scott Snyder and the master of horror himself, Stephen King! When notorious outlaw Skinner Sweet is attacked by an old enemy (who happens to be a member of the undead), the first American vampire is born... a vampire powered by the sun, stronger, fiercer, and meaner than anything that came before. Plus... Pearl Jones is a struggling young actress in 1920s Los Angeles. But when her big break brings her face-to-face with an ancient evil, her Hollywood dream quickly turns into a brutal, shocking nightmare.<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100341",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "VICTORIAN UNDEAD #5 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Ian Edginton (A) Davide Fabbri (CA) Simon Coleby",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411286?type=1",
        "Text": "Written by IAN EDGINTON <br/> Art by DAVIDE FABBRI <br/> Cover by SIMON COLEBY <br/> The zombie assault has London in shambles and the government panicked! Attempts at containment are failing, and they turn to Holmes and Watson for a last-ditch attempt at stopping the madness. Can they solve the riddle of the undead before a final decision on total annihilation is reached?<br/>"
    },
    {
        "ItemCode": "JAN100340",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "RESIDENT EVIL #4 (OF 6) (RES) ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK408088?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Ricardo Sanchez (A) Jheremy Raapack",
        "SRP": "SRP: $3.99",
        "Text": "Written by Rick Sanchez<br/> Art by Jheremy Raapack &amp; Ed Benes<br/> Cover by Kevin Sharpe<br/> <br/> Neuermann Giesel is the cat's meow of Ubelandia's 20-something party scene. So it's only natural that BSAA Agents Gere and Sugarman wonder why he's chosen to hang at the remote jungle compound of Fritz Giesel - the CEO of Giesel Industries - instead of at a trendy club. And a tour of the compound turns deadly as the two agents are caught in Neuermann's idea of a T-Virus play date.<br/> Plus don't miss superstar artist Ed Benes' 2-page origin story of Agent Mina Gere!<br/> On sale January 13 o 4 of 6 o 32 pg, FC, $3.99 US o MATURE READERS<br/>"
    },
    {
        "ItemCode": "JAN100339",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "SUPERNATURAL BEGINNINGS END #3 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Andrew Dabb, Daniel Loflin (A) Diego Olmos (CA) Photo Cover",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411279?type=1",
        "Text": "Written by ANDREW DABB &amp; DANIEL LOFLIN<br/> Art by DIEGO OLMOS &amp; MATTHEW DOW SMITH<br/> Photo cover<br/> Perpetually caught between Sam and John's arguments, Dean hits a boiling point and drags his brother out for some good ol' monster hunting - at the Museum of Natural History! Time for a little bonding over blood! But the boys' first \"hunt\" together goes tragically wrong...and has disastrous consequences for Sam.<br/>"
    },
    {
        "ItemCode": "JAN100338",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "MODERN WARFARE 2 GHOST #4 (OF 6) ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411262?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) David Lapham (A) Kevin J. West (CA) Federico Dallocchio",
        "SRP": "SRP: $3.99",
        "Text": "Written by DAVID LAPHAM <br/> Art by KEVIN WEST &amp; DAVID LAPHAM  <br/> Cover by FEDERICO DALLOCCHIO <br/> Now that Ghost is back in the real world, he's finding it hard to tell what's real anymore...until a face from his botched mission in Mexico appears. It's someone he thought long dead. Could this be another hallucination - or something far more sinister? The brutal action continues!<br/>"
    },
    {
        "ItemCode": "JAN100337",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "GOD OF WAR #1 (OF 6) (RES) ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Marv Wolfman (A) Andrea Sorrentino (CA) Andy Park",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK402683?type=1",
        "Text": "Written by Marv Wolfman<br/> Art by Kevin Sharpe<br/> Cover by Andy Park<br/>     The blockbuster Playstation game comes to life at WildStorm courtesy of writer Marv Wolfman (CRISIS ON INFINITE EARTHS) and artist Kevin Sharpe (RESIDENT EVIL)! Dive into the story behind what makes Kratos, the lead in the video game, a God of War! From his Spartan childhood, to the battles and tragedies that define him, to the war with the gods he currently wages, GOD OF WAR delivers the back-story fans have been clamoring for! And beware anyone who stand in his way! Whether they be god, barbarian, or minotaur matters not to Kratos - he's prepared to destroy all who oppose him!<br/>     Prepare for the third installment of the hot franchise in 2010 by picking up this action-packed 6-issue miniseries!<br/> On sale October 7 o 1 of 6 o 32 pg, FC, $3.99 US o MATURE READERS<br/>"
    },
    {
        "ItemCode": "JAN100336",
        "ReleaseDate": "In Shops: May 19, 2010",
        "Title": "WORLD OF WARCRAFT ASHBRINGER TP",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411401?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Micky Neilson (A/CA) Ludo Lullabi, Tony Washington",
        "SRP": "SRP: $14.99",
        "Text": "Collecting the 4-issue miniseries, this epic begins as the Lich King's plague of death ravages the kingdom of Lordaeron. Hidden away, a mighty blade is forged from a dark orb - a blade that will become legend."
    },
    {
        "ItemCode": "JAN100335",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "FREE REALMS #7 ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) J. S. Lewis (A) Jon Sommariva",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411238?type=1",
        "Text": "Written by J.S. Lewis<br/> Art and cover by Jon Sommariva; Allen Martinez <br/> Saving Queen Valerian's life launched Dane and Maya into the spotlight. All Maya wants is to return to a life of anonymity, but Dane is looking to parlay his 15 minutes of fame into a lifetime of fortune. He talks Maya into entering the Royal Scavenger Hunt with him, but when they get trapped in a crypt beneath Blackspore Swamp, the adventurers realize quickly that they may not live past the first stage.<br/>"
    },
    {
        "ItemCode": "JAN100334",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "DANTES INFERNO #4 (OF 6) ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411229?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Christos N. Gage (A) Diego Latorre",
        "SRP": "SRP: $3.99",
        "Text": "Written by CHRISTOS GAGE<br/> Art and cover by DIEGO LATORRE <br/> Beatrice and Lucifer are now married; only the consummation remains. Dante watches in agony as Beatrice pays the ultimate price for his sins and transforms into the Queen of Hell. Things can't possibly get worse...until Dante encounters his own mother in the Wood of Suicides.<br/>"
    },
    {
        "ItemCode": "JAN100333",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "SPARTA USA #1 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) David Lapham (A) Johnny Timmons (CA) David Lapham",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411400?type=1",
        "Text": "Written by DAVID LAPHAM <br/> Art and cover by JOHNNY TIMMONS <br/> 1:10 Variant cover by David Lapham<br/> There's never been a more American town than Sparta. In Sparta they believe in life, liberty and the pursuit of happiness through treachery, blackmail and murder - just like the Maestro taught them as he learned it from the U.S. President. Sparta is such a great place that no one ever thinks of leaving. It's been three years since anyone's tried, and he was never heard from again...until today. <br/> Today, Godfrey McLaine, the greatest quarterback in Sparta's history, has returned bigger, taller and redder than when he left. He's also armed with a secret that will expose the rotten core of the American Dream. Award-winning writer David Lapham (YOUNG LIARS, STRAY BULLETS) and artist Johnny Timmons (Wolverine) deliver a unique take on what it means to be an American!<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100332",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "SPARTA USA #1 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411399?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) David Lapham (A/CA) Johnny Timmons",
        "SRP": "SRP: $2.99",
        "Text": "Written by DAVID LAPHAM <br/> Art and cover by JOHNNY TIMMONS <br/> 1:10 Variant cover by David Lapham<br/> There's never been a more American town than Sparta. In Sparta they believe in life, liberty and the pursuit of happiness through treachery, blackmail and murder - just like the Maestro taught them as he learned it from the U.S. President. Sparta is such a great place that no one ever thinks of leaving. It's been three years since anyone's tried, and he was never heard from again...until today. <br/> Today, Godfrey McLaine, the greatest quarterback in Sparta's history, has returned bigger, taller and redder than when he left. He's also armed with a secret that will expose the rotten core of the American Dream. Award-winning writer David Lapham (YOUNG LIARS, STRAY BULLETS) and artist Johnny Timmons (Wolverine) deliver a unique take on what it means to be an American!<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100331",
        "ReleaseDate": "In Shops: May 19, 2010",
        "Title": "EX MACHINA DELUXE EDITION HC VOL 03 ",
        "SRP": "SRP: $29.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Brian K. Vaughan (A) Various (CA) Tony Harris",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411398?type=1",
        "Text": "Written by BRIAN K. VAUGHAN<br/> Art by TONY HARRIS, JOHN PAUL LEON &amp; others <br/> Cover by TONY HARRIS<br/> In this Deluxe hardcover collecting EX MACHINA #21-29, EX MACHINA: INSIDE THE MACHINE and the EX MACHINA SPECIAL #3, Mayor Mitchell Hundred faces difficult decisions regarding New York City's drug laws. But will a string of brazen, violent robberies and a shocking suicide affect the the Mayor's policy? And in a second story set during the New York blackout of 2003, the mayor must deal with a city gone dark.<br/>"
    },
    {
        "ItemCode": "JAN100330",
        "ReleaseDate": "In Shops: May 19, 2010",
        "Title": "EX MACHINA #49 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411236?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Brian K. Vaughan (A/CA) Tony Harris",
        "SRP": "SRP: $2.99",
        "Text": "Written by BRIAN K. VAUGHAN<br/> Art and cover by TONY HARRIS <br/> It's the bloody conclusion to \"Pro-Life,\" and the penultimate issue of this groundbreaking political thriller. Mayor Hundred makes the hardest decision of his career, as the final pieces fall into place for an unforgettable series finale.<br/>"
    },
    {
        "ItemCode": "JAN100329",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "ASTRO CITY THE DARK AGE BOOK FOUR #3 ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Kurt Busiek (A) Brent Eric Anderson (CA) Alex Ross",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411207?type=1",
        "Text": "Written by KURT BUSIEK<br/> Art by BRENT ANDERSON <br/> cover by ALEX ROSS<br/> The Pale Horseman makes his deadly debut! But is he a villain or the Dark Age's purest hero? Plus, Charles and Royal confront their parents' killer in Las Vegas, only to see matters take a strange and dangerous new path. Featuring Mirage, the Silver Agent, Honor Guard, the First Family, the Blue Knights and more!<br/>"
    },
    {
        "ItemCode": "JAN100328",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "AUTHORITY THE LOST YEAR #7 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411209?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Keith Giffen, Grant Morrison (A) Joel Gomez, Brian Stelfreeze (CA) Gene Ha",
        "SRP": "SRP: $2.99",
        "Text": "Story by KEITH GIFFEN &amp; GRANT MORRISON<br/> Written by KEITH GIFFEN<br/> Art by BRIAN STELFREEZE &amp; JOEL GOMEZ <br/> cover by GENE HA <br/> On a world where superheroes are seen as witches, super-science is used to hunt heroes down before they're given kangaroo trials and then, inevitably, executed. That's exactly what was done to this Earth's Apollo, and now that our Authority has arrived, they plan on making things better. But one thing must go right: the two Midnighters they now have can't end up killing each other.<br/>"
    },
    {
        "ItemCode": "JAN100327",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "WILDCATS #21",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Adam Beechen (A) Tim Seeley (CA) Marcus To",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411289?type=1",
        "Text": "Written by Adam Beechen <br/> Art by Tim Seeley &amp; Ryan Winn <br/> Cover by MARCUS TO &amp; SANDRA HOPE<br/> The war with the Red Blade comes to a dramatic, spectacular finish, as our desperate heroes pull out all the stops to keep the alien invaders from eradicating all life on Earth! Who, if anyone, will be left standing, and what kind of planet will be left for them to try to rebuild?<br/>"
    },
    {
        "ItemCode": "JAN100326",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "AUTHORITY #20",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411208?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Marc Bernardin, Adam Fereman (A) Alejandro Barrionuevo (CA) Sandra Hope, Marcus To",
        "SRP": "SRP: $2.99",
        "Text": "Written by Marc Bernardin &amp; Adam Freeman <br/> Art by Al Barrionuevo <br/> Cover by Marcus To &amp; Sandra Hope<br/> With the Carrier streaking through space beyond their control, the newly configured Authority find themselves on Daemon's doorstep unable to defend themselves against both incoming hostiles and a growing rebellion from within. With Jack and Christine struggling for control, the team finds salvation in the most unexpected of places.<br/>"
    },
    {
        "ItemCode": "JAN100325",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "MAD MAGAZINE #503",
        "SRP": "SRP: $5.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Various (A/CA) Various",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411397?type=1",
        "Text": "Written and illustrated by THE USUAL GANG OF IDIOTS<br/> We double-dog dare you to get your dose of guffaws and giggles with this newest issue!<br/>"
    },
    {
        "ItemCode": "JAN100324",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "SCOOBY DOO #154",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411269?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Paul Kupperberg, Embla Malmenlid (A) Fabio Laguna, Scott Neely (CA) Vincent DePorter",
        "SRP": "SRP: $2.50",
        "Text": "Written by PAUL KUPPERBERG <br/> Art by FABIO LAGUNA<br/> Cover by VINCENT DEPORTER<br/> According to legend, a Civil War-era schooner carrying the bulk of the Confederacy's wealth sank long ago. The gang joins a captain and his crew in hopes of making the historical discovery. But something's lurking in the water - something that couldn't possibly exist!<br/>"
    },
    {
        "ItemCode": "JAN100323",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "LOONEY TUNES #184",
        "SRP": "SRP: $2.50",
        "Publisher": "DC COMICS",
        "Creators": "(W) Various (A/CA) Various",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411258?type=1",
        "Text": "Written by SAM AGRO &amp; BILL MATHENY <br/> Art by ROBERT POPE, SCOTT MCRAE, DAVID ALVAREZ &amp; MIKE DECARLO<br/> Cover by VINCENT DEPORTER<br/> This issue is full of so much medical malpractice it's enough to make a duck go \"Quack.\"<br/>"
    },
    {
        "ItemCode": "JAN100322",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "CARTOON NETWORK ACTION PACK #47",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411227?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Various (A) Various (CA) Jay Stephens",
        "SRP": "SRP: $2.50",
        "Text": "Written by JOHN ROZUM, JOELLE SELLNER, &amp; JIM ALEXANDER <br/> Art by SCOTT JERALDS, SCOTT AWLEY, &amp; ETHEN BEAVERS<br/> Cover by JAY STEPHENS<br/> First, the Secret Saturdays discover a terrifying lake monster! Then, Zak and Fiskerton get caught in a sibling rivalry! And last, check out a world where Samurai Jack is only the size of a thumb!<br/>"
    },
    {
        "ItemCode": "JAN100321",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "TINY TITANS #26",
        "SRP": "SRP: $2.50",
        "Publisher": "DC COMICS",
        "Creators": "(W) Art Baltazar, Franco Aureliani (A) Art Baltazar",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411282?type=1",
        "Text": "Written by ART BALTAZAR &amp; FRANCO <br/> Art and cover by Art Baltazar<br/> It's the time of year for an all-green, never-mean issue of TINY TITANS! Miss Martian chases after Gizmo! Beast Boy chases after Miss Martian! Kroc eats things! Hmm, that last one doesn't quite fit... But wait - some of the things he eats are green! That's better.<br/>"
    },
    {
        "ItemCode": "JAN100320",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "SUPER FRIENDS #25",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411273?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sholly Fisch (A) Dario Brizuela (CA) Jason Bone",
        "SRP": "SRP: $2.50",
        "Text": "Written by SHOLLY FISCH<br/> Art by DARIO BRIZUELA<br/> Cover by J. BONE<br/> To commemorate 25 glorious issues, we're sending the team to compete in the Space Olympics! Of course, if they lose, Earth will be destroyed - but no need to tell them that!<br/>"
    },
    {
        "ItemCode": "JAN100319",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "BILLY BATSON AND THE MAGIC OF SHAZAM #14",
        "SRP": "SRP: $2.50",
        "Publisher": "DC COMICS",
        "Creators": "(W) Art Baltazar, Franco Aureliani (A/CA) Mike Norton",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411220?type=1",
        "Text": "<li>Written by Art Baltazar &amp; Franco   Art and cover by Mike Norton<br/> Black Adam's made a shocking new friend - and Freddy Freeman may be just what it takes to tip the scales and bring an end to Captain Marvel! It's a history-making brawl in the Natural History Museum, with art by fantastic new series regular Mike Norton (BLUE BEETLE, GREEN ARROW/BLACK CANARY)!<br/>"
    },
    {
        "ItemCode": "JAN100318",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "BATMAN THE BRAVE AND THE BOLD #15",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411217?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sholly Fisch (A/CA) Scott McRae, Robert Pope",
        "SRP": "SRP: $2.50",
        "Text": "Written by SHOLLY FISCH<br/> Art and cover by ROBERT POPE &amp; SCOTT MCRAE<br/> The race is on between Batman and The Flash to find out which hero is the world's fastest detective! All they have to do is solve the case of the Minute Mystery...or die trying!<br/>"
    },
    {
        "ItemCode": "JAN100309",
        "ReleaseDate": "In Shops: May 05, 2010",
        "Title": "DONG XOAI VIETNAM 1965 HC",
        "SRP": "SRP: $24.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Joe Kubert (A/CA) Joe Kubert",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411396?type=1",
        "Text": "Written by JOE KUBERT <br/> Art and cover by JOE KUBERT<br/> Joe Kubert, one of the most influential storytellers in comics history, tells the harrowing, true story of a detachment of Special Forces soldiers on a simple recon mission into the village of Dong Xoai, Vietnam, that turned suddenly deadly.<br/> DONG XOAI, VIETNAM 1965 has a unique perspective, since Kubert based the story on extensive information gathered from the surviving members of the unit. It covers not only the action of the event but the details of deployment and build-up that led to the deadly encounter for these young American G.I.s.<br/> For decades, Joe Kubert has shown readers the true face of war - all the suffering, horror, loss and heroism of our fighting forces. With DONG XAOI, he goes a step beyond to tell a gut-wrenching tale of sacrifice that will linger long after you are done reading.<br/>"
    },
    {
        "ItemCode": "JAN100308",
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "Title": "SUPERMAN THE COMING OF ATLAS TP",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411395?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Jack Kirby, James Robinson (A) Renato Guedes, Jose Wilson Magalhaes, Jack Kirby, D. Bruce Berry (CA) Alex Ross",
        "SRP": "SRP: $14.99",
        "Text": "Written by JAMES ROBINSON &amp; JACK KIRBY<br/> Art by RENATO GUEDES, JACK KIRBY &amp; OTHERS<br/> Cover by ALEX ROSS <br/> When Atlas stakes a claim on Metropolis in this tale from SUPERMAN #677-680, it's up to Superman and Krypto to take him down. Also including FIRST ISSUE SPECIAL #1, the 1975 tale that introduced Atlas!<br/>"
    },
    {
        "ItemCode": "JAN100307",
        "ReleaseDate": "In Shops: May 12, 2010",
        "Title": "SUPERBOY THE BOY OF STEEL HC",
        "SRP": "SRP: $19.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (A/CA) Francis Manapul",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411394?type=1",
        "Text": "Written by GEOFF JOHNS<br/> Art by FRANCIS MANAPUL   <br/> Cover by FRANCIS MANAPUL <br/> Superboy is back - and can't wait to jump back into his life in these tales from ADVENTURE COMICS #0-3 and 5-6, plus a tale from SUPERMAN SECRET FILES 2009. But which life will it be? Conner makes a beeline for the greatest place on Earth: Smallville. While Conner reunites with his former girlfriend, Wonder Girl, Lex Luthor and Brainiac form a partnership that will cause havoc throughout the DC Universe.<br/>"
    },
    {
        "ItemCode": "JAN100306",
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "Title": "SUPERMAN CHRONICLES TP VOL 08",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411393?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Jerry Siegel (A) John Sikela, Leo Nowak, Paul Cassidy (CA) Fred Ray",
        "SRP": "SRP: $14.99",
        "Text": "Written by JERRY SIEGEL <br/> Art by LEO NOWAK &amp; OTHERS<br/> Cover by FRED RAY<br/> In these stories from 1942's ACTION COMICS #44-46, WORLD'S FINEST COMICS #5 and SUPERMAN #14-15, The Man of Tomorrow faces threats from the mysterious Undersea City and more!<br/>"
    },
    {
        "ItemCode": "JAN100305",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "TEEN TITANS CHILDS PLAY TP",
        "SRP": "SRP: $14.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Bryan Q. Miller, Sean McKeever, J. T. Krul, Felicia D. Henderson (A) Jack Jadson, Yildiray Cinar, Julio Ferreira, Ruy Jose (CA) Joe Jadson (A/CA) Joe Bennett",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411392?type=1",
        "Text": "Written by SEAN MCKEEVER, BRYAN Q. MILLER &amp; FELICIA D. HENDERSON<br/> Art and cover by JOE BENNETT &amp; JACK JADSON<br/> The team faces the new Fearsome Five in these tales from TEEN TITANS #71-78. Plus, the Calculator seeks vengeance after the teen heroes failed to protect his children. <br/>"
    },
    {
        "ItemCode": "JAN100304",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "SOLOMON GRUNDY TP",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411391?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns, Scott Kolins (A/CA) Scott Kolins",
        "SRP": "SRP: $19.99",
        "Text": "Written by GEOFF JOHNS &amp; SCOTT KOLINS<br/> Art and cover by SCOTT KOLINS<br/> Discover how Solomon Grundy became an undead monster and one of the DC Universe's most feared villains in this epic tying into BLACKEST NIGHT. Featuring FACES OF EVIL: SOLOMON GRUNDY #1 and the seven-issue GRUNDY miniseries!<br/>"
    },
    {
        "ItemCode": "JAN100303",
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "Title": "SHOWCASE PRESENTS DIAL H FOR HERO TP",
        "SRP": "SRP: $9.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Dave Wood (A) Frank Springer, Sal Trapani (A/CA) Jim Mooney",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411390?type=1",
        "Text": "Written by DAVE WOOD <br/> Art by JIM MOONEY &amp; others <br/> Cover by JIM MOONEY<br/> The quirky series from HOUSE OF MYSTERY #156-173 is collected for the first time in this title introducing teenaged Robby Reed, whose discovery of the H-E-R-O dial leads to costumed adventure!<br/>"
    },
    {
        "ItemCode": "JAN100302",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "SECRET SIX DEPTHS TP",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411389?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Gail Simone (A) Various (CA) Daniel Luvisi",
        "SRP": "SRP: $14.99",
        "Text": "Written by GAIL SIMONE<br/> Art by NICOLA SCOTT, CARLOS RODRIGUEZ &amp; OTHERS <br/> Cover by DANIEL LUVISI<br/> With Batman's cowl up for grabs, two of The Secret Six think they should be the new Dark Knight. And a mission on Devil's Island draws the attention of Wonder Woman in this new collection of issues #8-14!<br/>"
    },
    {
        "ItemCode": "JAN100301",
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "Title": "CRISIS ON MULTIPLE EARTHS TP VOL 05",
        "SRP": "SRP: $19.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Gerry Conway (A) Rich Buckler, Dick Dillin, Dick Giordano, Bob Smith, Jim Starlin (CA) George P?rez",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411388?type=1",
        "Text": "Advance-solicited <li>On sale APRIL 21 </li><li>176 pg, FC, $19.99 US<br/> Written by GERRY CONWAY <br/> Art by DICK DILLIN, GEORGE PÉREZ &amp; OTHERS <br/> Cover by GEORGE PÉREZ<br/> A new helping of JLA/JSA crossovers is here, featuring stories from JUSTICE LEAGUE OF AMERICA #159, 160, 171, 172, 183, 184 and 185, guest-starring Jonah Hex, Enemy Ace, The New Gods and more!<br/>"
    },
    {
        "ItemCode": "JAN100300",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "RED ROBIN THE GRAIL TP",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411387?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Christopher Yost (A) Ramon Bachs, Art Thibert, Guy Major (CA) Francis Manapul",
        "SRP": "SRP: $17.99",
        "Text": "Written by CHRISTOPHER YOST<br/> Art by RAMON BACHS &amp; ART THIBERT<br/> Cover by FRANCIS MANAPUL <br/> A new Batman watches over Gotham City - but Tim Drake won't give up on the old one in this volume collecting RED ROBIN #1-5. In his new guise as Red Robin, Tim won't rest until Bruce Wayne is found!<br/>"
    },
    {
        "ItemCode": "JAN100299",
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "Title": "POWER GIRL A NEW BEGINNING TP",
        "SRP": "SRP: $17.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Justin Gray, Jimmy Palmiotti (A/CA) Amanda Conner",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411386?type=1",
        "Text": "Written by JUSTIN GRAY &amp; JIMMY PALMIOTTI<br/> Art and cover by AMANDA CONNER <br/> Exploding from the first six issues of her new, hit series, JSA leader Power Girl wants to build a new secret identity - but a villain from her past has other plans for her and to get his way, he's holding Manhattan hostage. Plus, a trio of sexy alien marauders hits Earth for the ultimate party. Unfortunately, by their standards, that means destroying it.<br/>"
    },
    {
        "ItemCode": "JAN100298",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "JSA TP VOL 04 THY KINGDOM COME PART 3",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411385?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns, Alex Ross, Peter J. Tomasi (A) Dale Eaglesham, Nathan Massengill, Jerry Ordway, Bob Wiacek, Fernando Pasarin, Mick Gray, Scott Kolins, Jack Purcell, Norm Rapmund (A/CA) Alex Ross",
        "SRP": "SRP: $19.99",
        "Text": "Written by GEOFF JOHNS, ALEX ROSS &amp; PETER TOMASI<br/> Art by ALEX ROSS, DALE EAGLESHAM, FERNANDO PASARIN &amp; NATHAN MASSENGILL <br/> Cover by ALEX ROSS <br/> Collecting JUSTICE SOCIETY OF AMERICA #19-22 and the JUSTICE SOCIETY: KINGDOM COME Specials MAGOG, SUPERMAN and THE KINGDOM, now in trade paperback! Picking up where PART TWO left off, The Justice Society begins to dissolve as Gog vows to bring peace to Earth in a way that frightens some and thrills others. Torn between Gog's desire to help the world and the moral cost it comes with, it's old guard vs. new as the line that was drawn is crossed.<br/>"
    },
    {
        "ItemCode": "JAN100297",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "BOOSTER GOLD DAY OF DEATH TP",
        "SRP": "SRP: $14.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Keith Giffen, Dan Jurgens (A) Various (CA) Dan Jurgens, Norm Rapmund",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411384?type=1",
        "Text": "Written by DAN JURGENS &amp; KEITH GIFFEN <br/> Art by DAN JURGENS, PAT OLLIFFE &amp; NORM RAPMUND <br/> Cover by JURGENS &amp; RAPMUND<br/> Booster Gold investigates the death of Batman - only to run afoul of another Batman who doesn't want Booster near this case. Collecting BOOSTER GOLD #20-25 and BRAVE AND THE BOLD #23.<br/>"
    },
    {
        "ItemCode": "JAN100296",
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "Title": "JONAH HEX SIX GUN WAR TP",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411383?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Justin Gray, Jimmy Palmiotti (A/CA) Cristiano Cucina",
        "SRP": "SRP: $14.99",
        "Text": "Written by JUSTIN GRAY &amp; JIMMY PALMOTTI<br/> Art and cover by 4/2<br/> In this epic from issues #44-49, Quentin Turnbull is out for vengeance on the man he believes is responsible for killing his son: Jonah Hex! Guest-starring Tallulah Black, Bat Lash and more!<br/>"
    },
    {
        "ItemCode": "JAN100295",
        "ReleaseDate": "In Shops: May 19, 2010",
        "Title": "ATOMIC KNIGHTS HC",
        "SRP": "SRP: $39.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) John Broome (A/CA) Murphy Anderson",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411382?type=1",
        "Text": "Written by JOHN BROOME<br/> Art and cover by MURPHY ANDERSON <br/> In a post-apocalyptic future, the Atomic Knights protect the surviving citizens against threats of all sorts in tales from STRANGE ADVENTURES #117, 120, 123, 126, 129, 132, 135, 136, 138, 141, 144, 147, 150, 153 156 and 160. Collected here for the first time!"
    },
    {
        "ItemCode": "JAN100294",
        "ReleaseDate": "In Shops: May 19, 2010",
        "Title": "BATMAN STREETS OF GOTHAM HC VOL 01 HUSH MONEY",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411381?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Paul Dini (A) J. G. Jones, Dustin Nguyen, Andrew Robinson, Alex Ross",
        "SRP": "SRP: $19.99",
        "Text": "Written by PAUL DINI <br/> Art by DUSTIN NGUYEN &amp; DEREK FRIDOLFS <br/> cover by DUSTIN NGUYEN <br/> How will the police feel about Gotham City's new Dark Knight - and can he control the crime in Gotham the way the old Batman did? Commissioner Gordon's about to find out as he teams with the new Batman to combat the fiery threat of Firefly in this new hardcover collecting BATMAN: STREETS OF GOTHAM #1-4, DETECTIVE COMICS #852 and BATMAN #685.<br/>"
    },
    {
        "ItemCode": "JAN100293",
        "ReleaseDate": "In Shops: May 26, 2010",
        "Title": "BATMAN LONG SHADOWS HC",
        "SRP": "SRP: $19.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Judd Winick (A) Ed Benes, Mark Bagley, Rob Hunter, Jack Purcell (CA) J. G. Jones",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411380?type=1",
        "Text": "Written by JUDD WINICK<br/> Art by ED BENES, MARK BAGLEY &amp; ROB HUNTER <br/> cover by J.G. JONES<br/> Can the new Batman maintain his grip on Gotham City's criminal element?<br/> With Bruce Wayne gone in the wake of BATMAN: R.I.P., Dick Grayson - formerly known as both Robin and Nightwing - becomes the new Batman in this new hardcover collecting BATMAN #687-691. And it's not long before the city's criminals put him to the test! With the Penguin intent on becoming Gotham's new crime kingpin and Two-Face waging a war of his own, how can any hero, let alone one who's just stepped into his role, stop them? It won't be easy - especially since he also has to round up a posse of escaped Arkham Asylum inmates.<br/>"
    },
    {
        "ItemCode": "JAN100292",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "WARLORD #12",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411287?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Mike Grell (A/CA) Mike Grell",
        "SRP": "SRP: $2.99",
        "Text": "Written by MIKE GRELL <br/> Art and cover by MIKE GRELL<br/> Death could not stop him! Shamballah has been destroyed, Deimos is resurrected and The Warlord is...defeated? A hero will die - but will the legend live on? The coming months will reveal all as DC's finest fantasy epic throws away the rulebook and takes a turn you never saw coming!<br/>"
    },
    {
        "ItemCode": "JAN100291",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "REBELS #14",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Antony Bedard (A) Jean-Claude St. Aubin (CA) Kalman Andrasofszky",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411266?type=1",
        "Text": "Written by TONY BEDARD <br/> Art by CLAUDE ST. AUBIN &amp; SCOTT HANNA <br/> Cover by KALMAN ANDRASOFSZKY<br/> The finale in the war against the new Starro the Conqueror! Can super-genius Vril Dox, Adam Strange and their grizzled band of rebels possibly gain victory against a mega-army from nine galaxies?<br/>"
    },
    {
        "ItemCode": "JAN100290",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "WONDER WOMAN #42",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411290?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Gail Simone (A) Fernando Dagnino (CA) Hi-Fi Colour Design (A/CA) Nicola Scott",
        "SRP": "SRP: $2.99",
        "Text": "Written by GAIL SIMONE<br/> Art and cover by NICOLA SCOTT &amp; DOUG HAZLEWOOD   <br/> Gail Simone and fan-favorite artist Nicola Scott reunite for this explosive tale featuring the stunning return of a star-spanning threat from Diana's past! Can even Wonder Woman stop Earth from this world-destroying madwoman? Guest-starring the Green Lantern Corps! Don't miss \"The Wrath of The Silver Serpent\"!<br/>"
    },
    {
        "ItemCode": "JAN100289",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "WEB #7",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Matthew Sturges (A) Roger Robinson (CA) Stanley Lau",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411288?type=1",
        "Text": "Written by MATTHEW STURGES <br/> Co-feature written by JOHN ROZUM Art by ROGER ROBINSON &amp; HILARY BARTA<br/> Co-feature art by TOM DERENICK &amp; BILL SIENKIEWICZ<br/> Cover by STANLEY \"ARTGERM\" LAU<br/> The Web has just killed for the first time! But has he really stunned the Stunner for good? His trip to the morgue will uncover some answers! Plus, the Hangman continues his undying watch over San Francisco!<br/>"
    },
    {
        "ItemCode": "JAN100288",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "SECRET SIX #19",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411270?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Gail Simone (A) Jim Calafiore (CA) Daniel Luvisi",
        "SRP": "SRP: $2.99",
        "Text": "Written by GAIL SIMONE <br/> Art by JIM CALAFIORE <br/> Cover by DANIEL LUVISI <br/> Catman's past crawls back to haunt him as Cheshire returns! Could the secret she's carrying spell the end of the Secret Six?<br/>"
    },
    {
        "ItemCode": "JAN100287",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "SHIELD #7",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Brandon Jerwa, Eric Trautmann (A) Michael Avon Oeming, Marco Rudy (CA) Sami Basri",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411271?type=1",
        "Text": "Written by ERIC TRAUTMANN; Co-feature written by BRANDON JERWA<br/> Art by MARCO RUDY &amp; MICK GRAY<br/> Co-feature art by MICHAEL AVON OEMING <br/> Cover by SAMI BASRI <br/> Fan-favorite artist Michael Avon Oeming (Powers) joins Brandon Jerwa in debuting the latest Red Circle hero - The Fox! Filmmaker Paul Patten Jr. heads from Seattle to the underbelly of Tokyo gangster life, caught up in a mission to discover the truth behind his late father's adventures, but becomes the modern embodiment of the Kitsune totem known as the Fox!<br/> Meanwhile, a new mission kicks off for the Shield - Operation Gunslinger! Hot on the trail of the mysterious H.I.V.E. splinter group Black Seven the Shield must lead a group of special operatives, one of whom strongly has his faith strongly shaken in his commanding officer. Will the Shield uphold his loyalty oath? Or is he about to go AWOL?<br/>"
    },
    {
        "ItemCode": "JAN100286",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "TEEN TITANS #81",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411281?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Felicia D. Henderson, Sean McKeever (A) Joe Bennett (A/CA) Yildiray Cinar",
        "SRP": "SRP: $3.99",
        "Text": "Written by FELICIA D. HENDERSON <br/> Co-feature written by SEAN MCKEEVER <br/> Art and cover by JOE BENNETT &amp; JACK JADSON <br/> Co-feature art by YILDIRAY CINAR &amp; JÚLIO FERREIRA<br/> The Teen Titans are reunited with Static, but can they survive the power of Holocaust? And will Static stay with the Titans if he survives? <br/> Plus, Ravager's nemesis forces her to make a decision: Is her life worth the lives of a dozen innocent girls?<br/>"
    },
    {
        "ItemCode": "JAN100285",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "MAGOG #7",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Keith Giffen (A/CA) John Dell, Howard Porter",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411260?type=1",
        "Text": "Written by KEITH GIFFEN  <br/> Art and cover by HOWARD PORTER &amp; JOHN DELL <br/> Magog's goddess mate goes undercover - in his friend Lauren's body! Top that with a new threat rearing its head toward Earth. It's too bad Magog's not a member of the JSA anymore - he could sure use the help! Guest-starring Zatanna!<br/>"
    },
    {
        "ItemCode": "JAN100284",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "TITANS #23",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411283?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Eddie Berganza (A) Scott Clark, Ardian Syaf (CA) Angel Unzueta",
        "SRP": "SRP: $2.99",
        "Text": "Written by EDDIE BERGANZA <br/> Art and cover by ANGEL UNZUETA <br/> Spotlight on Red Arrow! As Roy Harper lies in critical condition after the events of JUSTICE LEAGUE: CRY FOR JUSTICE #5, his fever dreams show him the perfect future life he wants for the Titans. Unfortunately for him, it's a life the Titans will never see.<br/>"
    },
    {
        "ItemCode": "JAN100283",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "NEMESIS THE IMPOSTORS #1 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Ivan Brandon (A) Cliff Richards (CA) Daniel Luvisi",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411379?type=1",
        "Text": "Written by IVAN BRANDON<br/> Art by CLIFF RICHARDS <br/> For Thomas Andrew Tresser, aka Nemesis, the world of metahuman espionage is never what it seems. After his recent \"reeducation\" at the hands of the Global Peace Agency, Nemesis finds himself thrust back into the real world with enemies seemingly around every corner. Tasked with uncovering the truth about his mission and the true identities of those hoping to unleash a great evil on the world, Nemesis is forced to confront the fact that he may not be able to trust anybody in the universe - including himself.<br/>"
    },
    {
        "ItemCode": "JAN100282",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "JUSTICE LEAGUE OF AMERICA #43 VAR ED",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411256?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) James Robinson (A) Mark Bagley (CA) Mike Mayhew",
        "SRP": "SRP: $3.99",
        "Text": "Written by JAMES ROBINSON<br/> Art by MARK BAGLEY &amp; ROB HUNTER <br/> 1:25 Variant cover by MIKE MAYHEW <br/> Following the decision that occurred in JUSTICE LEAGUE: CRY FOR JUSTICE and the events of JUSTICE LEAGUE: THE RISE AND FALL SPECIAL #1, the World's Greatest Heroes must come to terms with who they are and what they represent. Meanwhile, an all-new danger threatens the existence of everything past and present in the exciting finale of \"Team History.\"<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100281",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "JUSTICE LEAGUE OF AMERICA #43",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) James Robinson (A/CA) Mark Bagley",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411255?type=1",
        "Text": "Written by JAMES ROBINSON<br/> Art by MARK BAGLEY &amp; ROB HUNTER <br/> 1:25 Variant cover by MIKE MAYHEW <br/> Following the decision that occurred in JUSTICE LEAGUE: CRY FOR JUSTICE and the events of JUSTICE LEAGUE: THE RISE AND FALL SPECIAL #1, the World's Greatest Heroes must come to terms with who they are and what they represent. Meanwhile, an all-new danger threatens the existence of everything past and present in the exciting finale of \"Team History.\"<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100280",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "JUSTICE LEAGUE THE RISE OF ARSENAL #1 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411377?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) J. T. Krul (A) Various (CA) Mike Mayhew",
        "SRP": "SRP: $3.99",
        "Text": "Written by J.T. KRUL<br/> Art by GERALDO BORGES &amp; MARLO ALQUIZA<br/> Cover by GREG HORN; 1:25 variant cover by MIKE MAYHEW<br/> In JUSTICE LEAGUE: CRY FOR JUSTICE, Roy Harper lost everything at the hands of Prometheus, barely surviving the brutal severing of his arm. But when he finally awakens from his coma, Roy will find that his dangerous journey into despair is just beginning.Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100279",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "JUSTICE LEAGUE THE RISE OF ARSENAL #1 ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) J. T. Krul (A) Geraldo Borges (CA) Greg Horn",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411376?type=1",
        "Text": "Written by J.T. KRUL<br/> Art by GERALDO BORGES &amp; MARLO ALQUIZA<br/> Cover by GREG HORN; 1:25 variant cover by MIKE MAYHEW<br/> In JUSTICE LEAGUE: CRY FOR JUSTICE, Roy Harper lost everything at the hands of Prometheus, barely surviving the brutal severing of his arm. But when he finally awakens from his coma, Roy will find that his dangerous journey into despair is just beginning.Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100278",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "GREEN ARROW #31 VAR ED",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411414?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) J. T. Krul (A) Diogenes Neves (CA) Mike Mayhew",
        "SRP": "SRP: $2.99",
        "Text": "Written by J.T. KRUL <br/> Art by DIOGENES NEVES <br/> Cover by MAURO CASCIOLI<br/> 1:25 variant cover by MIKE MAYHEW<br/> \"The Fall of Green Arrow\" begins here! Spinning out of the shocking events of JUSTICE LEAGUE: CRY FOR JUSTICE and JUSTICE LEAGUE: THE RISE AND FALL SPECIAL #1 comes the destruction of Green Arrow. As Oliver Queen's inner turmoil and guilt overwhelms him, secrets are revealed that will tear him asunder. What will the Emerald Archer reveal to the world that will change his life and the lives of the people around him forever? And why are Hal Jordan (Green Lantern), Barry Allen (The Flash) and the rest of the Justice League hunting him?<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100277",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "GREEN ARROW #31",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) J. T. Krul (A) Federico Dallocchio (CA) Mauro Cascioli",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411221?type=1",
        "Text": "Written by J.T. KRUL <br/> Art by DIOGENES NEVES <br/> Cover by MAURO CASCIOLI<br/> 1:25 variant cover by MIKE MAYHEW<br/> \"The Fall of Green Arrow\" begins here! Spinning out of the shocking events of JUSTICE LEAGUE: CRY FOR JUSTICE and JUSTICE LEAGUE: THE RISE AND FALL SPECIAL #1 comes the destruction of Green Arrow. As Oliver Queen's inner turmoil and guilt overwhelms him, secrets are revealed that will tear him asunder. What will the Emerald Archer reveal to the world that will change his life and the lives of the people around him forever? And why are Hal Jordan (Green Lantern), Barry Allen (The Flash) and the rest of the Justice League hunting him?<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100276",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "JUSTICE LEAGUE RISE AND FALL SPECIAL #1 VAR ED",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411375?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) J. T. Krul, James Robinson (A/CA) Mike Mayhew",
        "SRP": "SRP: $3.99",
        "Text": "Written by JAMES ROBINSON &amp; J.T. KRUL <br/> Art and 1:25 variant cover by MIKE MAYHEW<br/> Cover by MAURO CASCIOLI<br/> Following the stunning conclusion to JUSTICE LEAGUE: CRY FOR JUSTICE comes the next epic chapter for the World's Greatest Heroes. What controversial decision has created a split in the League? A new meaning to the term \"hunt for justice\" creates fear in the villain populace. Plus, a shocking secret is revealed that will change Green Arrow's life forever.<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100275",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "JUSTICE LEAGUE RISE AND FALL SPECIAL #1",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) J. T. Krul (A) Fabrizio Fiorentino, Mike Mayhew, Diogenes Neves (CA) Art Germ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411374?type=1",
        "Text": "Written by JAMES ROBINSON &amp; J.T. KRUL <br/> Art and 1:25 variant cover by MIKE MAYHEW<br/> Cover by MAURO CASCIOLI<br/> Following the stunning conclusion to JUSTICE LEAGUE: CRY FOR JUSTICE comes the next epic chapter for the World's Greatest Heroes. What controversial decision has created a split in the League? A new meaning to the term \"hunt for justice\" creates fear in the villain populace. Plus, a shocking secret is revealed that will change Green Arrow's life forever.<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100274",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "JSA ALL STARS #4",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411253?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Matthew Sturges, Jen Van Meter (A) Travis Moore (A/CA) Freddie Williams II",
        "SRP": "SRP: $3.99",
        "Text": "Written by MATTHEW STURGES <br/> Co-feature written by JEN VAN METER<br/> Art and cover by FREDDIE WILLIAMS II <br/> Co-feature art by TRAVIS MOORE &amp; DAN GREEN<br/> The All-Stars are forced to team with the Injustice Society against Johnny Sorrow's unearthly accomplice! And only Star Girl knows what she must sacrifice to save friend and foe alike! The hero and villain team-ups continue in the co-feature, as Liberty Belle and Hourman join their proven enemies Tigress and Icicle, who hold essential clues as to the  whereabouts of the ancient mysticism embodied in the Staff of Life!<br/>"
    },
    {
        "ItemCode": "JAN100273",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "JUSTICE SOCIETY OF AMERICA #37",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Bill Willingham (CA) Allen Passalaqua (A/CA) Jesus Merino",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411257?type=1",
        "Text": "Written by BILL WILLINGHAM <br/> Art by JESUS MERINO &amp; JESSE DELPERDANG <br/> Cover by JESUS MERINO<br/> The war takes a turn for the worse for the JSA as the enemy fires up their super power-negating \"Darkness Engine.\" But the terror rises when the team learns that the machine is powered by the black egg that used to be their colleague Obsidian!<br/>"
    },
    {
        "ItemCode": "JAN100272",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "POWER GIRL #10",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411265?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Justin Gray, Jimmy Palmiotti (A/CA) Amanda Conner",
        "SRP": "SRP: $2.99",
        "Text": "Written by JIMMY PALMIOTTI &amp; JUSTIN GRAY<br/> Art and cover by AMANDA CONNER <br/> Power Girl squares off against Satanna and her Animal Army just as Terra enters the fray! This should be a good thing, but somehow it looks like Power Girl's got a new enemy!<br/>"
    },
    {
        "ItemCode": "JAN100271",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "JONAH HEX #53",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Justin Gray, Jimmy Palmiotti (A/CA) Billy Tucci",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411252?type=1",
        "Text": "Written by JIMMY PALMIOTTI &amp; JUSTIN GRAY<br/> Art and cover by BILLY TUCCI <br/> Billy Tucci (SGT. ROCK: THE LOST BATTALION) saddles up to illustrate the latest HEX! What person connects a coffin, a train robbery, a wicked double-crossing, and a wannabe-actress-turned-saloon-dancer? You know his name. It's right there in the title. But he knows yours, too, so you better buy the book - or else...<br/>"
    },
    {
        "ItemCode": "JAN100270",
        "ReleaseDate": "In Shops: Jun 02, 2010",
        "Title": "JONAH HEX NO WAY BACK HC",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411373?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Justin Gray, Jimmy Palmiotti (A) John Stanisci (A/CA) Tony DeZuniga",
        "SRP": "SRP: $19.99",
        "Text": "Written by JUSTIN GRAY &amp; JIMMY PALMIOTTI <br/> Art and cover by TONY DEZUNIGA<br/> Discover how Jonah Hex's rough family life transformed him into the justice-thirsty vigilante he became. Legendary Hex artist Tony DeZuniga returns to illustrate a new, archetypal epic written by the acclaimed HEX team of Jimmy Palmiotti and Justin Gray. This heartbreaking, brutal original graphic novel is set against the unforgiving landscape of the Wild West and delves into Hex's painful past, revealing for the first time how his difficult upbringing made him that era's most feared bounty hunter. Along the way, Hex must come to terms with the death of a loved one, long thought lost, battle El Papagayo and his gang of bandits, and attempt to make peace with his own past.<br/>"
    },
    {
        "ItemCode": "JAN100269",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "MILESTONE FOREVER #2 ",
        "SRP": "SRP: $5.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Dwayne McDuffie (A) Chris Cross, Denys Cowan, John Paul Leon (CA) Stanley Lau",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411261?type=1",
        "Text": "Written by DWAYNE MCDUFFIE<br/> Art by JOHN PAUL LEON, DENYS COWAN, <br/> PRENTIS ROLLINS, CHRISCROSS, &amp; ROB STULL<br/> Cover by STANLEY \"ARTGERM\" LAU<br/> You've read Dwayne McDuffie's JUSTICE LEAGUE OF AMERICA arc, \"When Worlds Collide\"! Now find out what pushed Dharma into madness and how Dakota came to the DCU. Witness the triumphant return of some of Milestone's original creative teams as they give you a story that no one else could! <br/>"
    },
    {
        "ItemCode": "JAN100268",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "GREAT TEN #5 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411241?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Antony Bedard (A) Scott McDaniel (CA) Stanley Lau",
        "SRP": "SRP: $2.99",
        "Text": "Written by TONY BEDARD<br/> Art by SCOTT MCDANIEL &amp; ANDY OWENS <br/> Cover by STANLEY \"ARTGERM\" LAU <br/> With the truth behind the return of the Old Gods of China finally revealed, the team looks toward its leader - August General in Iron - to take control. But where do the General's loyalties lie? Will he lead with his mind and satisfy mainland China - or will he follow his heart and side with Ghost Fox Killer and the rest of the team? Be here to find out!<br/>"
    },
    {
        "ItemCode": "JAN100267",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "HUMAN TARGET #2 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Peter Johnson, Len Wein (A) Simon Coleby, Cliff Rathburn, Bruno Redondo (CA) John Paul Leon",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411249?type=1",
        "Text": "Written by LEN WEIN &amp; PETER JOHNSON<br/> Art by BRUNO REDONDO, SERGIO SANDOVAL &amp; SIMON COLEBY <br/> Cover by JP Leon<br/> Based on the anticipated series from Warner Bros. TV premiering on Fox this January! Christopher Chance, the Human Target, has undertaken a deadly mission to protect an informant against organized crime families while he collects evidence throughout Europe. Unfortunately, the mob's next stop is at the Vatican. Can even Chance's considerable skills get them inside the holiest and most heavily guarded of locales?<br/>"
    },
    {
        "ItemCode": "JAN100266",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "FLASH SECRET FILES AND ORIGINS 2010 #1",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411372?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates, Geoff Johns (A) Scott Kolins (A/CA) Francis Manapul",
        "SRP": "SRP: $3.99",
        "Text": "Written by GEOFF JOHNS<br/> Art by SCOTT KOLINS, FRANCIS MANAPUL &amp; OTHERS <br/> Cover by FRANCIS MANAPUL <br/> Flash Facts! In the aftermath of BLACKEST NIGHT and THE FLASH: REBIRTH comes the beginning of a new era for Barry Allen and the deadly Rogues! As Barry readjusts to life again, strange happenings explode across Central City that will lead to one of the most bizarre murder mysteries Barry will ever face in the upcoming THE FLASH #1! Plus, don't miss Wally West, Kid Flash, Gorilla Grodd and a cold case that will send The Flash down a path unlike any other. Run - don't walk - to pick it up!<br/>"
    },
    {
        "ItemCode": "JAN100265",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "FIRST WAVE #1 ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(A) Rags Morales (CA) Neal Adams",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411371?type=1",
        "Text": "Written by BRIAN AZZARELLO <br/> Art by RAGS MORALES <br/> Cover by J.G. JONES; 1:10 Variant cover by NEAL ADAMS<br/> DC's shocking new pulp universe is finally unveiled! In the shadows of the War, the roots of the Golden Tree cabal grew deep into the heart of a fallen world... and the leaders at the heart of this secret organization see no place in their utopia for heroism. Doc Savage, struggling with the loss of his father, has been blind to their advance - until now. Central City's mysterious Spirit has caught wind of their plans as well. But whose side have the Blackhawks chosen? What is the Red Right Hand? And where is the Batman? Eisner Award winner Brian Azzarello (100 BULLETS, JOKER) and superstar Rags Morales (IDENTITY CRISIS) craft a DC universe like you've never seen before! It's a world with no supermen, only mortal men... Death can come at any moment, and adventure can still be found at every corner of the map! Will Doc Savage be the first to lead the coming world or the last to be crushed under its heel?<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100264",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "FIRST WAVE #1 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411370?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(A) Rags Morales (CA) J. G. Jones",
        "SRP": "SRP: $3.99",
        "Text": "Written by BRIAN AZZARELLO <br/> Art by RAGS MORALES <br/> Cover by J.G. JONES; 1:10 Variant cover by NEAL ADAMS<br/> DC's shocking new pulp universe is finally unveiled! In the shadows of the War, the roots of the Golden Tree cabal grew deep into the heart of a fallen world... and the leaders at the heart of this secret organization see no place in their utopia for heroism. Doc Savage, struggling with the loss of his father, has been blind to their advance - until now. Central City's mysterious Spirit has caught wind of their plans as well. But whose side have the Blackhawks chosen? What is the Red Right Hand? And where is the Batman? Eisner Award winner Brian Azzarello (100 BULLETS, JOKER) and superstar Rags Morales (IDENTITY CRISIS) craft a DC universe like you've never seen before! It's a world with no supermen, only mortal men... Death can come at any moment, and adventure can still be found at every corner of the map! Will Doc Savage be the first to lead the coming world or the last to be crushed under its heel?<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100263",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "DOOM PATROL #8",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Keith Giffen (A) Matthew Clark, Ron Randall (CA) Justiniano",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411235?type=1",
        "Text": "Written by KEITH GIFFEN<br/> Art by MATTHEW CLARK<br/> Cover by JUSTINIANO <br/> A pandimensional wrecking crew has come to Oolong Island looking for something specific, and the Doom Patrol had better find it while there's still an island left!  <br/>"
    },
    {
        "ItemCode": "JAN100262",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "BOOSTER GOLD #30",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411225?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Dan Jurgens (A) Jerry Ordway (A/CA) Dan Jurgens",
        "SRP": "SRP: $2.99",
        "Text": "Written by DAN JURGENS<br/> Art and cover by DAN JURGENS &amp; NORM RAPMUND <br/> When Booster Gold rescues his sister from the timestream - saving her from imminent death - he soon realizes that the sister he saved is not the same girl he remembers. Will the two be reunited as Booster Gold and Goldstar - or will Michele disappear into the timestream forever? And what will become of Rip Hunter? Be here to find out!<br/>"
    },
    {
        "ItemCode": "JAN100261",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "SUPERMAN BATMAN #70",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Joe Casey (A) Jason Fabok, Ardian Syaf",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411276?type=1",
        "Text": "Written by JOE CASEY <br/> Art and cover by ARDIAN SYAF &amp; VICENTE CIFUENTES<br/> As Batman springs his trap for the shape-shifting Durlan terrorist stranded on Earth, Superman and NRG-X battle out Round Two in the Fortress of Solitude!<br/>"
    },
    {
        "ItemCode": "JAN100260",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "SUPERMAN 80 PAGE GIANT #1",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411369?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Jason Hall, Rik Hoskin, Kathryn Immonen, Pat McCallum, Ben McCool, Mike Raicht, Sean Ryan (A) Matt Camp, Clayton Henry, Julian Lopez, Michael Shoyket, R. B. Silva, Charles Paul Wilson, Tonci Zonjic (CA) Brad Anderson, Aaron Lopresti",
        "SRP": "SRP: $5.99",
        "Text": "Written by KATHRYN IMMONEN, BEN MCCOOL &amp; OTHERS <br/> Art by CLAYTON HENRY, JULIÁN LÓPEZ &amp; OTHERS<br/> Cover by AARON LOPRESTI<br/> A thrilling collection of up-and-coming talent tackles Superman and the heroes of Metropolis! Packed with guest stars galore including Bizarro, Lois Lane and many more, these timeless tales of The Man of Steel are destined to thrill!<br/>"
    },
    {
        "ItemCode": "JAN100259",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "SUPERGIRL #51",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates (A) Jamal Igle (CA) Joshua Middleton",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411274?type=1",
        "Text": "Written by STERLING GATES<br/> Art by JAMAL IGLE &amp; JON SIBAL <br/> Cover by JOSHUA MIDDLETON <br/> \"Brainiac &amp; The Legion of Super-Heroes\" Part 2! Amidst Brainiac's assault on New Krypton, General Zod has brandished the Legion of Super-Heroes terrorists and imprisoned them! Superboy will do his best to free them, but he'll have to go through Supergirl first! That's right, it's the Super-battle of the sexes you've been waiting for! Poor Ma Kent is going to be so disappointed in them...<br/>"
    },
    {
        "ItemCode": "JAN100258",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "SUPERMAN #698",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411275?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) James Robinson (A) Bernard Chang, Javier Pina (CA) Santiago Arcas, Bit, Julian Lopez",
        "SRP": "SRP: $2.99",
        "Text": "Written by JAMES ROBINSON<br/> Art BERNARD CHANG &amp; JAVIER PINA <br/> Cover by JULIÁN LÓPEZ &amp; BIT<br/> \"Brainiac &amp; The Legion of Super-Heroes\" Part 3! Superman is trapped on Brainiac's ship while New Krypton burns! Mon-El will need to call upon all the skills he's learned in the last year if he's going to have a chance of freeing the Man of Steel! Plus, what secret about Brainiac will the duo learn that may help turn the tide?<br/>"
    },
    {
        "ItemCode": "JAN100257",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "ACTION COMICS #887",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) James Robinson, Greg Rucka, Eric Trautmann (A) CAFU, Pere P?rez (CA) Kalman Andrasofszky",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411203?type=1",
        "Text": "Written by GREG RUCKA &amp; ERIC TRAUTMANN<br/> Co-feature written by JAMES ROBINSON &amp; GREG RUCKA<br/> Art by PERE PÉREZ; Co-feature art by CAFU <br/> Cover by KALMAN ANDRASOFSZKY<br/> In this corner - the already beaten, exhausted and bruised Nightwing &amp; Flamebird! And in this corner - the reincarnation of the all-powerful Kryptonian sun god Rao! Place your bets! (Smart money's on the sun god.)<br/> And in the co-feature, Captain Atom has to answer for his past sins by fighting the entire Justice League of America single-handedly! <br/>"
    },
    {
        "ItemCode": "JAN100256",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "ADVENTURE COMICS #512 VAR ED",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411368?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates, James Robinson (A) Julian Lopez (CA) Duncan Rouleau",
        "SRP": "SRP: $3.99",
        "Text": "Written by JAMES ROBINSON &amp; STERLING GATES <br/> Co-Feature written by ERIC TRAUTMANN <br/> Art by EDUARDO PANSICA, TRAVIS MOORE, EBER FERRERIA, JULIO FERRERIA <br/> Co-feature art by PIER GALLO<br/> Covers by JOE QUINONES<br/> 1:10 variant covers by RAFAEL ALBUQUERQUE<br/> Part 4 of  this spring's Superman event \"Last Stand On New Krypton\" <br/> Starting way back in \"The Lightning Saga,\" various clues have been planted about a group of Legionnaires undercover in the 21st century. Who are they and why are they here? And what does their mission have to do with the fate of New Krypton? James Robinson (SUPERMAN) and Julián López (WORLD'S FINEST) may have an answer or two! Meanwhile, in a tale of the 31st century by Sterling Gates (SUPERGIRL) and Clayton Henry (ADVENTURE COMICS), the Legion of Super-Heroes infiltrates a hidden Legion of Super-Villains base! The horrifying plans Brainiac 5 discovers inside will alter Superman's life - FOREVER! Plus, in the co-feature by Eric Trautmann (ACTION COMICS) and newcomer Pier Gallo, learn more about General Lane's Human Defense Corps - Earth's best line of defense against the looming Kryptonian threat!<br/> Retailers please note: These issue will ship with two covers each. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100255",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "ADVENTURE COMICS #9",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates, James Robinson, Eric Trautmann (A) Pier Gallo, Travis Moore, Eduardo Pansica (CA) Joe Quinones",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411367?type=1",
        "Text": "Written by JAMES ROBINSON &amp; STERLING GATES <br/> Co-Feature written by ERIC TRAUTMANN <br/> Art by EDUARDO PANSICA, EBER FERRERIA, TRAVIS MOORE, JULIO FERREIRA<br/> Co-feature art by PIER GALLO<br/> Cover by JOE QUINONES<br/> 1:10 variant covers by Rafael Albuquerque<br/> Part 4 of this spring's Superman event \"Last Stand On New Krypton\" <br/> Starting way back in \"The Lightning Saga,\" various clues have been planted about a group of Legionnaires undercover in the 21st century. Who are they and why are they here? And what does their mission have to do with the fate of New Krypton? James Robinson (SUPERMAN) and Julián López (WORLD'S FINEST) may have an answer or two! Meanwhile, in a tale of the 31st century by Sterling Gates (SUPERGIRL) and Clayton Henry (ADVENTURE COMICS), the Legion of Super-Heroes infiltrates a hidden Legion of Super-Villains base! The horrifying plans Brainiac 5 discovers inside will alter Superman's life - FOREVER! Plus, in the co-feature by Eric Trautmann (ACTION COMICS) and newcomer Pier Gallo, learn more about General Lane's Human Defense Corps - Earth's best line of defense against the looming Kryptonian threat!<br/> Retailers please note: This issue will ship with two covers each. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100254",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "ADVENTURE COMICS #511 VAR ED",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411204?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates, James Robinson (A) Julian Lopez Travis Moore (CA) Joe Quinones",
        "SRP": "SRP: $3.99",
        "Text": "Written by JAMES ROBINSON &amp; STERLING GATES <br/> Co-Feature written by ERIC TRAUTMANN <br/> Art by JULIÁN LÓPEZ TRAVIS MOORE and JULIO FERREIRA <br/> Co-feature art by PIER GALLO<br/> Covers by FRANCIS MANAPUL <br/> 1:10 variant cover by AARON LOPRESTI<br/> Prelude to this spring's Superman event \"Last Stand On New Krypton\"<br/> Starting way back in \"The Lightning Saga,\" various clues have been planted about a group of Legionnaires undercover in the 21st century. Who are they and why are they here? And what does their mission have to do with the fate of New Krypton? James Robinson (SUPERMAN) and Julián López (WORLD'S FINEST) may have an answer or two! Meanwhile, in a tale of the 31st century by Sterling Gates (SUPERGIRL) and Clayton Henry (ADVENTURE COMICS), the Legion of Super-Heroes infiltrates a hidden Legion of Super-Villains base! The horrifying plans Brainiac 5 discovers inside will alter Superman's life - FOREVER! Plus, in the co-feature by Eric Trautmann (ACTION COMICS) and newcomer Pier Gallo, learn more about General Lane's Human Defense Corps - Earth's best line of defense against the looming Kryptonian threat!<br/> Retailers please note: These issue will ship with two covers each. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100253",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "ADVENTURE COMICS #8",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates, James Robinson, Eric Trautmann (A) Pier Gallo, Julian Lopez, Travis Moore (CA) Brian Buccellato, Francis Manapul",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411205?type=1",
        "Text": "Written by JAMES ROBINSON &amp; STERLING GATES <br/> Co-Feature written by ERIC TRAUTMANN <br/> Art by JULIAN LOPEZ, TRAVIS MOORE and JULIO FERREIRA<br/> Co-feature art by PIER GALLO<br/> Cover by FRANCIS MANAPUL <br/> 1:10 variant cover by  AARON LOPRESTI<br/> Prelude to this spring's Superman event \"Last Stand On New Krypton\" <br/> Starting way back in \"The Lightning Saga,\" various clues have been planted about a group of Legionnaires undercover in the 21st century. Who are they and why are they here? And what does their mission have to do with the fate of New Krypton? James Robinson (SUPERMAN) and Julián López (WORLD'S FINEST) may have an answer or two! Meanwhile, in a tale of the 31st century by Sterling Gates (SUPERGIRL) and Clayton Henry (ADVENTURE COMICS), the Legion of Super-Heroes infiltrates a hidden Legion of Super-Villains base! The horrifying plans Brainiac 5 discovers inside will alter Superman's life - FOREVER! Plus, in the co-feature by Eric Trautmann (ACTION COMICS) and newcomer Pier Gallo, learn more about General Lane's Human Defense Corps - Earth's best line of defense against the looming Kryptonian threat!<br/> Retailers please note: These issue will ship with two covers each. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100252",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "SUPERMAN SECRET ORIGIN #5 (OF 6) VAR ED ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK409645?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (A/CA) Gary Frank, Jonathan Sibal",
        "SRP": "SRP: $3.99",
        "Text": "On sale February 24 <li>5 of 6 </li><li>40 pg, FC, $3.99 US<br/> Written by Geoff Johns <br/> Art and cover by Gary Frank &amp; Jon Sibal<br/> Superman versus Metallo - for the first time! Witness the origin of one of Superman's most-feared foes, as an attack by Lex Luthor goes awry and gives birth to the evil of Metallo. Can an inexperienced Man of Steel handle a foe with a heart of Kryptonite? Meanwhile, Lois Lane and Perry White are close to revealing Luthor as the monster that he is - but are they willing to pay for that truth with their lives?<br/> Retailers please note: This issue will ship with two covers. For every 10 copies of the Standard Edition (with a cover by Gary Frank &amp; Jon Sibal), retailers may order one copy of the Variant Edition (with a cover by Gary Frank &amp; Jon Sibal). Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100251",
        "ReleaseDate": "In Shops: Apr 07, 2010",
        "Title": "SUPERMAN SECRET ORIGIN #5 (OF 6) ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (CA) Brad Anderson (A/CA) Gary Frank",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK409644?type=1",
        "Text": "On sale February 24 <li>5 of 6 </li><li>40 pg, FC, $3.99 US<br/> Written by Geoff Johns <br/> Art and cover by Gary Frank &amp; Jon Sibal<br/> Superman versus Metallo - for the first time! Witness the origin of one of Superman's most-feared foes, as an attack by Lex Luthor goes awry and gives birth to the evil of Metallo. Can an inexperienced Man of Steel handle a foe with a heart of Kryptonite? Meanwhile, Lois Lane and Perry White are close to revealing Luthor as the monster that he is - but are they willing to pay for that truth with their lives?<br/> Retailers please note: This issue will ship with two covers. For every 10 copies of the Standard Edition (with a cover by Gary Frank &amp; Jon Sibal), retailers may order one copy of the Variant Edition (with a cover by Gary Frank &amp; Jon Sibal). Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100250",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "SUPERMAN LAST STAND OF NEW KRYPTON #1 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411365?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates, James Robinson (A) Pete Woods (CA) Marcos Marz",
        "SRP": "SRP: $3.99",
        "Text": "Written by JAMES ROBINSON &amp; STERLING GATES<br/> Art by PETE WOODS <br/> Cover by ANDY KUBERT<br/> 1:25 variant cover by MARCOS MARZ <br/> Presenting the start of the new Superman event \"Brainiac &amp; The Legion of Super-Heroes\"! It's New Krypton's worst nightmare as Brainiac attacks the planet, determined to recapture the city of Kandor! But General Zod has been waiting for this moment since Brainiac first attacked Old Krypton - he has a plan to save his people, but at the cost of Earth and the future as we know it! So it's up to Superman, Supergirl, Superboy and the Legion of Super-Heroes to stop the two madmen before they destroy everything! Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100249",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "SUPERMAN LAST STAND OF NEW KRYPTON #1 ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sterling Gates, James Robinson (A) Pete Woods (CA) Brad Anderson, Andy Kubert",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411364?type=1",
        "Text": "Written by JAMES ROBINSON &amp; STERLING GATES<br/> Art by PETE WOODS <br/> Cover by ANDY KUBERT<br/> 1:25 variant cover by MARCOS MARZ <br/> Presenting the start of the new Superman event \"Brainiac &amp; The Legion of Super-Heroes\"! It's New Krypton's worst nightmare as Brainiac attacks the planet, determined to recapture the city of Kandor! But General Zod has been waiting for this moment since Brainiac first attacked Old Krypton - he has a plan to save his people, but at the cost of Earth and the future as we know it! So it's up to Superman, Supergirl, Superboy and the Legion of Super-Heroes to stop the two madmen before they destroy everything! Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100248",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "BATMAN CONFIDENTIAL #42",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411215?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Sam Kieth (A) Sam Kieth",
        "SRP": "SRP: $2.99",
        "Text": "Written by SAM KIETH<br/> Art and cover by SAM KIETH <br/> The \"Ghosts\" storyline written and drawn by Sam Kieth continues with part 3 of 4! Batman and Callie become closer as they literally share their troubles when Batman goes blind! And the creature they're fighting continues taking the two down memory lane. But can either Batman or Callie handle being forced to face the loss of their parents?<br/>"
    },
    {
        "ItemCode": "JAN100247",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "RED ROBIN #10",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Christopher Yost (A/CA) Marcus To",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411267?type=1",
        "Text": "<li>On sale MARCH 10   32 pg, FC, $2.99 US<br/> Written by CHRISTOPHER YOST <br/> Art and cover by MARCUS TO &amp; RAY MCCARTHY  <br/> The Red Robin/Batgirl crossover continues as Ra's al Ghul targets everyone in Bruce Wayne's \"family\" for death - and only Red Robin and Batgirl can stop it. Except Batgirl's not so sure about Tim these days...especially once he starts working with one of Ra's' own assassins. Plus, Ra's al Ghul vs. Hush! Vicki Vale vs. Alfred! And Tam Fox continues her search only to run into even more trouble. Continued from this month's Batgirl #8!<br/>"
    },
    {
        "ItemCode": "JAN100246",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "OUTSIDERS #28",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411264?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Dan DiDio (A/CA) Philip Tan",
        "SRP": "SRP: $2.99",
        "Text": "<li>On sale MARCH 24   32 pg, FC, $2.99 US<br/> Written by Dan DiDio<br/> Art and cover by Philip Tan &amp; Jonathan Glapion<br/> It's the ultimate battle royal as team member faces off against team member! It's Geo-Force verses Black Lightning for the control - and the fate - of The Outsiders, and the team will never EVER be the same again!<br/>"
    },
    {
        "ItemCode": "JAN100245",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "GOTHAM CITY SIRENS #10",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Paul Dini (A) Andres Guinaldo (CA) Guillem March",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411240?type=1",
        "Text": "<li>On sale MARCH 31   32 pg, FC, $2.99 US<br/> Written by PAUL DINI<br/> Art and cover by GUILLEM MARCH  <br/> Is The Riddler friend or foe? One thing's for sure - he definitely isn't making life easy for Catwoman, Poison Ivy and Harley Quinn!<br/>"
    },
    {
        "ItemCode": "JAN100244",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "BATGIRL #8",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411211?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Bryan Q. Miller (A) Talent Caldwell, Yvel Guichet, John Stanisci (CA) Stanley Lau",
        "SRP": "SRP: $2.99",
        "Text": "<li>On sale MARCH 10   32 pg, FC, $2.99 US<br/> Written by BRYAN Q. MILLER<br/> Art by LEE GARBETT &amp; TREVOR SCOTT <br/> Cover by PHIL NOTO<br/> The RED ROBIN crossover begins here! When Tim Drake returns to Gotham City, the last person he expects to find in the Batcave is Stephanie Brown. But when Ra's al Ghul attacks on Batman's closest allies, Red Robin and Batgirl will have to put the past aside to save Leslie Thompkins's life. Continued in Red Robin #10!<br/>"
    },
    {
        "ItemCode": "JAN100243",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "AZRAEL #6",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Fabian Nicieza (A) Ramon Bachs",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411210?type=1",
        "Text": "On sale MARCH 17 <li>32 pg, FC, $2.99 US<br/> Written by FABIAN NICIEZA </li><li>Art by RAMON BACHS &amp; JOHN STANISCI <br/> Cover by FRANCESCO MATTINA<br/> Having been exposed to the memories of his predecessors, Michael Lane is consumed with learning all he can about their past but fears that what he learns will inform his future. How did past warriors from the Order of Purity who wore the Suit of Sorrows handle their spiral into madness? And how did the agent of the Order of St. Dumas handle these rogue madmen? <br/>"
    },
    {
        "ItemCode": "JAN100242",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "BATMAN STREETS OF GOTHAM #10",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411216?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Marc Andreyko, Paul Dini (A) Jeremy Haun (A/CA) Dustin Nguyen",
        "SRP": "SRP: $3.99",
        "Text": "Written by PAUL DINI; Co-feature written by MARC ANDREYKO<br/> Art by DUSTIN NGUYEN &amp; DEREK FRIDOLFS; Co-feature art by JEREMY HAUN<br/> Cover by DUSTIN NGUYEN <br/> It's Batman, Robin and Abuse struggling against the deadly clutches of Mr. Zsasz. With the lives of kidnapped children at stake, it's up to Gotham City's finest heroes to save the day. And in the Manhunter co-feature, Two-Face's trial comes to a surprising end as a new trial starts! Can Kate balance all of that with her need to spend time as Manhunter? And what's Kate's son Ramsey doing in Gotham?!<br/>"
    },
    {
        "ItemCode": "JAN100241",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "DETECTIVE COMICS #863",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Greg Rucka (A) Cully Hamner, Scott Kolins (CA) J. H. Williams",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411233?type=1",
        "Text": "Written by GREG RUCKA <br/> Art by JOCK<br/> Co-feature art by CULLY HAMNER <br/> Cover by JH WILLIAMS III<br/> When Batman and Batwoman each face off against a knife-wielding killer, they soon find themselves working different sides of the same case. But will they arrive in time to rescue the missing girl and stop the killer from claiming another victim? Things do not end well in \"Cutter\" Part 3. And in The Question, the mastermind behind the human trafficking ring and the gunrunning scheme is finally revealed, and The Question and the Huntress find themselves in the fight of their lives.<br/>"
    },
    {
        "ItemCode": "JAN100240",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "BATMAN #697",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411212?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Tony S. Daniel (A/CA) Tony S. Daniel",
        "SRP": "SRP: $2.99",
        "Text": "Written by TONY DANIEL <br/> Art by TONY DANIEL &amp; SANDU FLOREA <br/> Cover by TONY DANIEL <br/> Who wears the Black Mask? The true identity of Gotham City's new crimelord is finally revealed and that identity will surprise everybody - especially Batman! And after the final showdown between Black Mask and The Dark Knight, will things ever be the same for Kittyhawk and the Reaper?<br/>"
    },
    {
        "ItemCode": "JAN100239",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "BATMAN AND ROBIN #10 VAR ED",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Grant Morrison (A) Scott Hanna (A/CA) Andy Clarke",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411214?type=1",
        "Text": "Written by GRANT MORRISON<br/> Art by ANDY CLARKE &amp; SCOTT HANNA<br/> Cover by FRANK QUITELY<br/> 1:25 variant cover by ANDY CLARKE<br/> Art sensation Andy Clarke (R.E.B.E.L.S., BATMAN CONFIDENTIAL) joins writer Grant Morrison for an exciting three-issue arc titled \"Batman vs. Robin\"! Why would Talia al Ghul manipulate her son Damian into taking action against Batman? Will Damian do as Mother says...or stay loyal to Dick Grayson? Plus, more on the Domino Killer, Oberon Sexton, and the menace of El Penitente's drug cartel! Is this already the end for the new Dynamic Duo?<br/> Retailers please note:This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100238",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "BATMAN AND ROBIN #10",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411213?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Grant Morrison (A) Andy Clarke (CA) Frank Quitely",
        "SRP": "SRP: $2.99",
        "Text": "Written by GRANT MORRISON<br/> Art by ANDY CLARKE &amp; SCOTT HANNA<br/> Cover by FRANK QUITELY<br/> 1:25 variant cover by ANDY CLARKE<br/> Art sensation Andy Clarke (R.E.B.E.L.S., BATMAN CONFIDENTIAL) joins writer Grant Morrison for an exciting three-issue arc titled \"Batman vs. Robin\"! Why would Talia al Ghul manipulate her son Damian into taking action against Batman? Will Damian do as Mother says...or stay loyal to Dick Grayson? Plus, more on the Domino Killer, Oberon Sexton, and the menace of El Penitente's drug cartel! Is this already the end for the new Dynamic Duo?<br/> Retailers please note:This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100237",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "GREEN LANTERN CORPS #46 VAR ED (BLACKEST NIGHT) ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Peter J. Tomasi (A) Patrick Gleason (CA) Greg Horn",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411246?type=1",
        "Text": "Written by PETER J. TOMASI<br/> Art and cover by PATRICK GLEASON &amp; REBECCA BUCHMAN<br/> 1:25 Variant cover by RODOLFO MIGLIARI<br/> Blackest Night comes to its epic and stunning conclusion in this over-sized issue as the Green Lantern Corps descends on Earth to make their final stand against Nekron and the Black Lanterns!<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100236",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "GREEN LANTERN CORPS #46 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411245?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Peter J. Tomasi (A/CA) Patrick Gleason",
        "SRP": "SRP: $3.99",
        "Text": "Written by PETER J. TOMASI<br/> Art and cover by PATRICK GLEASON &amp; REBECCA BUCHMAN<br/> 1:25 Variant cover by RODOLFO MIGLIARI<br/> Blackest Night comes to its epic and stunning conclusion in this over-sized issue as the Green Lantern Corps descends on Earth to make their final stand against Nekron and the Black Lanterns!<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100235",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "GREEN LANTERN #52 VAR ED ",
        "SRP": "SRP: $2.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (A) Doug Mahnke (CA) Shane Davis",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411244?type=1",
        "Text": "Written by GEOFF JOHNS<br/> Art and cover by DOUG MAHNKE &amp; CHRISTIAN ALAMY<br/> 1:25 Variant cover by SHANE DAVIS &amp; SANDRA HOPE<br/> BLACKEST NIGHT'S penultimate chapter is here, and you do not want to miss this issue. Trust us on this one.<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100234",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "GREEN LANTERN #52 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411243?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (A/CA) Doug Mahnke",
        "SRP": "SRP: $2.99",
        "Text": "Written by GEOFF JOHNS<br/> Art and cover by DOUG MAHNKE &amp; CHRISTIAN ALAMY<br/> 1:25 Variant cover by SHANE DAVIS &amp; SANDRA HOPE<br/> BLACKEST NIGHT'S penultimate chapter is here, and you do not want to miss this issue. Trust us on this one.<br/> Retailers please note: This issue will ship with two covers. Please see the Previews Order Form for more information.<br/>"
    },
    {
        "ItemCode": "JAN100233",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "BLACKEST NIGHT #8 ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (A/CA) Ivan Reis",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411224?type=1",
        "Text": "Written by GEOFF JOHNS<br/> Art and cover by IVAN REIS, OCLAIR ALBERT &amp; JOE PRADO<br/> 1:25 Variant cover by RODOLFO MIGLIARI<br/> 1:100 Sketch variant cover by IVAN REIS<br/> The extra-sized conclusion to the most talked-about event in comics is here, and the results will change the course of the DC Universe for years to come. Earth has become the final battleground for life versus death, but how will our heroes fight back against the darkness of sentient space itself? And what does the future hold for Green Lantern, The Flash and the rest of the world's greatest heroes and villains? Find out here as the stage is set for the next epic era of DC Comics!<br/> Retailers please note: This issue will ship with three covers. Please see the Previews Order Form for more information.<br/> On sale MARCH 31 <li>8 of 8 </li><li>40 pg, FC, $3.99 US<br/>"
    },
    {
        "ItemCode": "JAN100232",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "BLACKEST NIGHT #8 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411223?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (A) Ivan Reis (CA) Doug Mahnke",
        "SRP": "SRP: $3.99",
        "Text": "Written by GEOFF JOHNS<br/> Art and cover by IVAN REIS, OCLAIR ALBERT &amp; JOE PRADO<br/> 1:25 Variant cover by RODOLFO MIGLIARI<br/> 1:100 Sketch variant cover by IVAN REIS<br/> The extra-sized conclusion to the most talked-about event in comics is here, and the results will change the course of the DC Universe for years to come. Earth has become the final battleground for life versus death, but how will our heroes fight back against the darkness of sentient space itself? And what does the future hold for Green Lantern, The Flash and the rest of the world's greatest heroes and villains? Find out here as the stage is set for the next epic era of DC Comics!<br/> Retailers please note: This issue will ship with three covers. Please see the Previews Order Form for more information.<br/> On sale MARCH 31 <li>8 of 8 </li><li>40 pg, FC, $3.99 US<br/>"
    },
    {
        "ItemCode": "JAN100231",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "BLACKEST NIGHT #8 ",
        "SRP": "SRP: $3.99",
        "Publisher": "DC COMICS",
        "Creators": "(W) Geoff Johns (A/CA) Ivan Reis",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411222?type=1",
        "Text": "Written by GEOFF JOHNS<br/> Art and cover by IVAN REIS, OCLAIR ALBERT &amp; JOE PRADO<br/> 1:25 Variant cover by RODOLFO MIGLIARI<br/> 1:100 Sketch variant cover by IVAN REIS<br/> The extra-sized conclusion to the most talked-about event in comics is here, and the results will change the course of the DC Universe for years to come. Earth has become the final battleground for life versus death, but how will our heroes fight back against the darkness of sentient space itself? And what does the future hold for Green Lantern, The Flash and the rest of the world's greatest heroes and villains? Find out here as the stage is set for the next epic era of DC Comics!<br/> Retailers please note: This issue will ship with three covers. Please see the Previews Order Form for more information.<br/> On sale MARCH 31 <li>8 of 8 </li><li>40 pg, FC, $3.99 US<br/>"
    },
    {
        "ItemCode": "JAN100195",
        "ReleaseDate": "In Shops: Jun 30, 2010",
        "Title": "GANTZ TP VOL 11 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410663?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Hiroya Oku (A/CA) Hiroya Oku",
        "SRP": "SRP: $12.99",
        "Text": "The blue phase is here! Gantz creator Oku Hiroya seems to have based his popular Gantz series on a season-based cycle, and now that we're entering the second set of ten books, we're all blue here at Dark Horse as Hiroya boldly takes us into the increasingly scary world of Gantz. Kei's been dealing with a handsome schoolmate who seems obsessed with all things Gantz, and in volume 11, we'll find out how frightfully obsessed this guy is. It's a whole new world of Gantz's alien urban warfare, and things are certainly not settling into any kind of comfort. Be ready for a dizzying new volume of Gantz!<br/> <br/> o Gantz has proven to be one of the most popular adult anime in recent years, with over 190,000 copies sold in the U.S. alone!<br/> <br/> o Each volume of Gantz comes shrink-wrapped and carries an 18+ content advisory.<br/>"
    },
    {
        "ItemCode": "JAN100194",
        "ReleaseDate": "In Shops: Sep 29, 2010",
        "Title": "CHOBITS DARK HORSE OMNIBUS ED VOL 02",
        "SRP": "SRP: $24.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Clamp (A/CA) Clamp",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410658?type=1",
        "Text": "In a world where people rely on computers to escape loneliness, the logical conclusion is the persocom-attractive robot companions that are becoming everyone's boyfriend and girlfriend. Chi is a persocom, but she is also one of the legendary \"Chobits,\" experimental persocoms built to acquire full awareness and emotion.<br/> <br/> As Hideki and his friends search for the abducted Chi, others are watching them-others who know who built Chi, and why . . . and what went terribly wrong. It is already known that the affectionate persocom can in fact be quite dangerous . . . but the real danger is what the soul of this new machine means for the future of the human heart. Because it was never the computers who were weak, it was the people who made them . . . and if Hideki wants to truly save Chi, he needs the courage to truly love her! The conclusion of the best-selling Chobits saga!<br/> <br/> * \"Chobits is perhaps CLAMP's most mature work to date, and not just 'mature' in the fan service sense. This time, they take love into the twenty-first century, exploring humans' relationship with technology . . . The series is not only one of the sexiest manga in its genre, it is also one of the most endearing.\"-Manga: The Complete Guide<br/> <br/> * The Dark Horse series of CLAMP omnibus editions has truly raised the bar for manga collections!"
    },
    {
        "ItemCode": "JAN100191",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "BPRD TP VOL 12 WAR ON FROGS",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410944?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Mike Mignola, John Arcudi (A) Guy Davis, Herb Trimpe, John Severin, Peter Snejbjerg, Karl Moline (CA) Mike Mignola",
        "SRP": "SRP: $17.99",
        "Text": "The Bureau for Paranormal Research and Defense's ongoing war against the frog monsters explodes in five short stories set before Roger's death in B.P.R.D.: The Black Flame. <br/> o Collects B.P.R.D.: War on Frogs #1-#4, \"Revival\" from MySpace Dark Horse Presents #8-#9, and an original eight-page story by Guy Davis.<br/> o The covers of all new volumes of B.P.R.D. include the line \"From the pages of Hellboy\" above the title.<br/> <br/> o Series writer John Arcudi and Hellboy creator Mike Mignola join up with an incredible team of artists: John Severin (Two-Fisted Tales), Karl Moline (Fray, Buffy the Vampire Slayer), Peter Snejbjerg (Starman, The Books of Magic), Herb Trimpe (The Incredible Hulk), and multiple Eisner Award-winning series artist Guy Davis!<br/> <br/> <br/> B.P.R.D.: King of Fear™, War on Frogs™ © 2010 Mike Mignola.<br/>  <br/>  <br/>"
    },
    {
        "ItemCode": "JAN100190",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "BPRD KING OF FEAR #3 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) John Arcudi, Mike Mignola (A) Guy Davis (CA) Mike Mignola",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410655?type=1",
        "Text": "B.P.R.D.: KING OF FEAR #3 (of 5)<br/> <br/> Mike Mignola (W/Cover), John Arcudi (W), Guy Davis (A), and Dave Stewart (C)<br/> <br/> On sale Mar 10<br/> FC, 32 pages<br/> $2.99<br/> Miniseries<br/> <br/> While scouring the Tibetan caverns to obliterate the monstrous frog colony, Liz and Abe face the King of Fear-who's found a powerful new ally in his quest to destroy the surface world!<br/> <br/> The B.P.R.D. take on frogs, subterraneans, and giant squid-bots! <br/> <br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100183",
        "ReleaseDate": "In Shops: May 19, 2010",
        "Title": "CREEPY COMICS #3",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410661?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Dan Braun, Nicola Cuti, Cody Goodfellow, Craig Haffner, Joe Harris, Doug Moench (A) Jason Shawn Alexander, Ken Barr, Dennis Calero, Gene Colan, Kevin Ferrara, Greg Scott, Angelo Torres (CA) Chuck Pyle",
        "SRP": "SRP: $4.99",
        "Text": "CREEPY #3<br/> <br/> Various (W/A)<br/> <br/> On sale Feb 24<br/> b&amp;w, 48 pages<br/> $4.99<br/> Ongoing<br/> <br/> Uncle Creepy is back with the third thick and icky issue of Creepy! This issue Doug Moench and Angelo Torres team up to tell a tale of demonic devotion and organized crime, Joe Harris and Jason Shawn Alexander wrap their warped three-parter, \"The Curse,\" and a weird revisionist look back at the fall of the Nazi empire reveals a shocking truth-evil never dies! Plus an all-new Loathsome Lore, a bonus Creepy classic story, and more!<br/> <br/> o Creepy debuted to rave reviews in July 2009, and the first issue sold out!<br/> <br/> \"Terrifyingly good!\" - Cory Doctorow, boingboing.net<br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100182",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "BUFFY THE VAMPIRE SLAYER #33 TWILIGHT PT 2 ",
        "SRP": "SRP: $2.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Brad Meltzer (A/CA) Georges Jeanty",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410656?type=1",
        "Text": "BUFFY THE VAMPIRE SLAYER #33: TWILIGHT part 2 (of 4)<br/> <br/> Brad Meltzer (W), Georges Jeanty (P/Cover), Andy Owens (I), Michelle Madsen (C), and Jo Chen (Cover)<br/> <br/> On sale Mar 3<br/> FC, 40 pages<br/> $2.99<br/> Ongoing <br/> <br/> Acclaimed novelist and comics writer Brad Meltzer (The Book of Lies, Identity Crisis) continues his pivotal story arc! The Slayer army has suffered heavy losses throughout Season Eight and faced all kinds of threats new and old, but the one mystery connecting it all has been the identity of the Big Bad: Twilight. In this issue, Buffy finally confronts Twilight one on one, setting the stage for Twilight's unmasking in Buffy #34!<br/> <br/> Brad Meltzer, series artist Georges Jeanty, and executive producer Joss Whedon up the stakes as Buffy's most epic season yet races to a climax!<br/> <br/> <br/> <br/> <br/> Buffy the Vampire Slayer™ &amp; © 2009 Twentieth Century Fox Film Corporation. All rights reserved<br/>"
    },
    {
        "ItemCode": "JAN100181",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "BUFFY THE VAMPIRE SLAYER #33 TWILIGHT PT 2 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410657?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Brad Meltzer (A) Georges Jeanty (CA) Jo Chen",
        "SRP": "SRP: $2.99",
        "Text": "BUFFY THE VAMPIRE SLAYER #33: TWILIGHT part 2 (of 4)<br/> <br/> Brad Meltzer (W), Georges Jeanty (P/Cover), Andy Owens (I), Michelle Madsen (C), and Jo Chen (Cover)<br/> <br/> On sale Mar 3<br/> FC, 40 pages<br/> $2.99<br/> Ongoing <br/> <br/> Acclaimed novelist and comics writer Brad Meltzer (The Book of Lies, Identity Crisis) continues his pivotal story arc! The Slayer army has suffered heavy losses throughout Season Eight and faced all kinds of threats new and old, but the one mystery connecting it all has been the identity of the Big Bad: Twilight. In this issue, Buffy finally confronts Twilight one on one, setting the stage for Twilight's unmasking in Buffy #34!<br/> <br/> Brad Meltzer, series artist Georges Jeanty, and executive producer Joss Whedon up the stakes as Buffy's most epic season yet races to a climax!<br/> <br/> <br/> <br/> <br/> Buffy the Vampire Slayer™ &amp; © 2009 Twentieth Century Fox Film Corporation. All rights reserved<br/>"
    },
    {
        "ItemCode": "JAN100176",
        "ReleaseDate": "In Shops: May 26, 2010",
        "Title": "MADE WITH 90% RECYCLED ART TP",
        "SRP": "SRP: $10.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Scott Meyer (A/CA) Scott Meyer",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410959?type=1",
        "Text": "MADE WITH 90% RECYCLED ART: A COLLECTION OF BASIC INSTRUCTIONS VOLUME 2<br/> <br/> Scott Meyer (W/A)<br/> <br/> On sale May 12<br/> b&amp;w, 120 pages<br/> $10.99<br/> TPB, 7\" x 7\"<br/> <br/> Comic and cartoonist Scott Meyer is back with yet another book of bad advice wrapped in good intentions. Learn such important skills as How to Talk to a New Parent, How to Engage in Prefight Smack Talk, How to Complain about Work, How to Properly Perform a High Five, and more!<br/> <br/> A former stand-up comedian, Meyer channels his extensive and varied wit into four panels of side-splitting culture commentary every other day or so and posts them to his website, basicinstructions.net. Our second collection of those Basic Instructions, Made with 90% Recycled Art, will likely spend some time on the copy machine before certain pages find themselves on cubicle walls worldwide.<br/> <br/> o A Basic Instructions strip was sighted taped to the wall on Food Network's Ace of Cakes!<br/> <br/> o 10,000 website readers every day!<br/>"
    },
    {
        "ItemCode": "JAN100139",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "USAGI YOJIMBO #127 SWORD OF NARUKAMI",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410668?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Stan Sakai (A/CA) Stan Sakai",
        "SRP": "SRP: $3.50",
        "Text": "USAGI YOJIMBO #127: THE SWORD OF NARUKAMI part 1 (of 1)<br/> <br/> Stan Sakai (W/A)<br/> <br/> On sale Mar 31<br/> b&amp;w, 24 pages<br/> $3.50<br/> Ongoing <br/> <br/> The rabbit ronin joins a disgraced samurai on a tragic mission in this brand-new standalone tale! Since the kidnapping of Lord Masaki's son, clan retainer Inuyoshi has a tarnished reputation. The ransom was paid and the victim returned, but it was Inuyoshi's responsibility to protect Lord Masaki's son. Ordered to commit seppuku-ritualized suicide-to atone for his negligence, Inuyoshi has vowed to first recover the ransom, the Sword of Narukami. Usagi chooses to help Inuyoshi on his mission, but develops reservations, as success will mean death for Inuyoshi!<br/> <br/> <br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100138",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "AGE OF REPTILES JOURNEY #3 ",
        "SRP": "SRP: $3.50",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Ricardo Delgado (A) Ricardo Delgado",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410653?type=1",
        "Text": "AGE OF REPTILES: THE JOURNEY #3 (of 4)<br/> <br/> Ricardo Delgado (W/A) and Jim Campbell (C)<br/> <br/> On sale Mar 3<br/> FC, 32 pages<br/> $3.50<br/> Miniseries<br/> <br/> Things seem like they're looking up for the herd of prehistoric herbivores forced from their home by plummeting winter temperatures. Their migration has taken them through barren lands and across the paths of deadly predators, but now, in the wake of last issue's vicious raptor attack, they've found what might be a promising new home-an old- growth forest with plenty of food and shelter for all. But a hungry tyrannosaurus rex still stalks the herd, and the journey's not over yet!<br/> <br/> Ricardo Delgado-a prolific development and storyboard artist-returns once again to his critically acclaimed, Eisner Award-winning comic series! <br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100137",
        "ReleaseDate": "In Shops: Sep 15, 2010",
        "Title": "HARVEY COMICS CLASSICS TREASURY TP VOL 01 CASPER",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410948?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Larz Bourne, Izzy Klein (A) Warren Kremer, Howie Post, Steve Muffatti, Dave Tendlar, Martin Taras",
        "SRP": "SRP: $14.99",
        "Text": "THE HARVEY COMICS TREASURY VOLUME 1: CASPER THE FRIENDLY GHOST AND FRIENDS<br/> <br/> Larz Bourne (W), Izzy Klein (W), Warren Kremer (A), Dave Tendlar (A), Martin Taras (A), Howard Post (A), Steve Muffatti (A), and others <br/> <br/> On sale May 12<br/> FC, 200 pages<br/> $14.99<br/> TPB, 6\" x 9\"<br/> <br/> Here comes Casper the Friendly Ghost, starring in the first of the new Harvey Comics Treasury compendiums! Following on the heels of Dark Horse's fabulously successful five-volume Harvey Comics Classics comes this new series of books, each containing two hundred pages of stunning, full-color reprints from Harvey's golden years! Since the 1950s, the famous Harvey Comics family of cartoon stars has charmed and delighted children and grownups alike. And no wonder: Harvey employed some of the best writers and artists in the business, and their work has an enduring quality that has turned these timeless tales into true classics! <br/> <br/> o Harvey comic books, cartoons, and television shows have touched millions and truly helped define the word classic while remaining popular!<br/> <br/> o Two hundred pages of stunning, full-color reprints for under fifteen dollars!<br/> <br/>  <br/>  <br/>"
    },
    {
        "ItemCode": "JAN100136",
        "ReleaseDate": "In Shops: May 05, 2010",
        "Title": "LITTLE LULU TP VOL 23 BOGEY SNOWMAN",
        "SRP": "SRP: $14.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) John Stanley (A) John Stanley, Irving Tripp",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410664?type=1",
        "Text": "LITTLE LULU VOLUME 23: THE BOGEY SNOWMAN AND OTHER STORIES<br/> <br/> John Stanley (W/A) and Irving Tripp (A)<br/> <br/> On sale May 26<br/> FC, 200 pages<br/> $14.99<br/> TPB, 6\" x 9\"<br/> <br/> Lulu Moppet and the neighborhood kids are let loose on Main Street once again, in a compilation of never-before-reprinted stories!<br/> <br/> Featuring several wintertime tales, this collection from funnybook pioneers John Stanley and Irving Tripp bursts at the seams with snowball fights, pranks involving snowdrifts and icy doorsteps, and other winter delights, like the hilarious story of the Bogey Snowman. As always, laughs abound in every panel for humor lovers of any age!<br/> <br/> o Collecting Marge's Little Lulu #112 through #117, The Bogey Snowman is the latest in Dark Horse's new series presenting Little Lulu in all its full-color glory-a hysterical selection of goodies for any season!<br/> <br/> o These full-color volumes pick up where Dark Horse's black-and-white Little Lulu collections left off!<br/> <br/> <br/> Copyright © 2010 by Classic Media, Inc. LITTLE LULU is a registered trademark of Classic Media, Inc. All rights reserved.<br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100133",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "LITTLE LULU GIANT SIZE TP VOL 01",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410947?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) John Stanley (A/CA) John Stanley, Irving Tripp",
        "SRP": "SRP: $24.99",
        "Text": "John Stanley and Irving Tripp's long run on Little Lulu is a milestone in American comics, as hilarious to grownups as it is to their children. With Stanley's popularity at an all-time high, Dark Horse is proud to take you back to the beginning of this legendary run.<br/> <br/> Collecting some of the earliest, out-of-print volumes of Dark Horse's acclaimed reprint series, this massive 664-page omnibus contains the first fourteen issues Little Lulu appeared in-featuring Lulu Moppet and her friends in all sorts of clever schemes and silly situations.  <br/> <br/> o Priced at only $24.99 and containing fourteen comic books' worth of material, this is the most affordable way to build a library of John Stanley's masterpiece!<br/> <br/> 664-pages of Lulu fun!<br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100132",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "PREDATOR PREY TO HEAVENS TP",
        "SRP": "SRP: $15.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) John Arcudi (A) Javier Saltares, Walden Wong (CA) Raymond Swanland",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410958?type=1",
        "Text": "The world's attention is focused painfully on a brutal third-world civil war, a merciless sectarian conflict sparing neither soldier nor civilian, grandmother nor child. But amidst the terror and carnage, where great nations and powerful interests jockey for position and advantage, another blood feud rages in the shadows, one no more humane but decidedly less human. Two warring tribes from the stars have chosen Earth's killing fields as their arena, with each clan sworn to eradicate the other . . . and all who stand between them. Each is the other's prey, each the other's Predator.<br/> <br/> The hunt resumes as Dark Horse Books unleashes Predator once again into the graphic-fiction jungle. Features the creative team of writer John Arcudi (Aliens, B.P.R.D., Doom Patrol) and artist Javier Saltares (Aliens vs. Predator, Ghost Rider).<br/> <br/> o Collects the hit 2009 Predator miniseries.<br/>"
    },
    {
        "ItemCode": "JAN100131",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "ERB JOHN CARTER OF MARS JESSE MARSH YEARS HC",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410946?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Paul S. Newman (A) Jesse Marsh",
        "SRP": "SRP: $29.99",
        "Text": "EDGAR RICE BURROUGHS' JOHN CARTER OF MARS: THE JESSE MARSH YEARS<br/> <br/> Paul S. Newman (W) and Jesse Marsh (A)<br/> <br/> On sale May 26<br/> FC, 120 pages<br/> $29.99<br/> TPB, 6 5/8\" x 10 3/16\" <br/> <br/> In 1947, Jesse Marsh-an artist who would inspire generations of comics creators and earn the esteem of professional peers such as industry legends Russ Manning and Alex Toth-won over millions of readers with his four-color vision of Edgar Rice Burroughs' beloved character Tarzan. To the delight of his readers, Marsh would continue to draw Tarzan comics for the following nineteen years. But his passion for Burroughs' creations wasn't limited to the legendary writer's jungle lord, and in the early 1950s he teamed up with prolific comics writer Paul S. Newman to breathe life into another of Burroughs' beloved heroes: the courageous adventurer John Carter of Mars!<br/> <br/> o Edgar Rice Burroughs' John Carter of Mars: The Jesse Marsh Years reprints all three issues of Dell's Four Color Comics: John Carter of Mars series in their entirety and is sure to delight fans of science fiction and Golden Age comics alike!<br/> <br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100130",
        "ReleaseDate": "In Shops: Mar 03, 2010",
        "Title": "MASS EFFECT REDEMPTION #3 ",
        "SRP": "SRP: $3.50",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) John Jackson Miller, Mac Walters (A) Omar Francia (CA) Daryl Mandryk",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410665?type=1",
        "Text": "MASS EFFECT: REDEMPTION #3 (of 4)<br/> <br/> Mac Walters (W), John Jackson Miller (W), Omar Francia (A), Michael Atiyeh (C), and Daryl Mandryk (Cover)<br/> <br/> On sale Mar 3<br/> FC, 32 pages<br/> $3.50<br/> Miniseries<br/> <br/> Liara T'Soni finds herself both pursuing Commander Shepard's abductors and on the run herself as Mass Effect: Redemption nears its explosive conclusion-revealing secrets crucial to the story of Mass Effect 2 along the way!<br/> <br/> The Mass Effect saga has revolutionized science fiction, and Mass Effect 2 lead writer Mac Walters brings all the same intelligence, drama, and action to this riveting adventure that tests the limits of what one friend will do to save another.<br/> <br/> o Read a preview of the first issue at masseffect.com, and in Buffy the Vampire Slayer #30 and Star Wars: Knights of the Old Republic #48!<br/>"
    },
    {
        "ItemCode": "JAN100129",
        "ReleaseDate": "In Shops: Mar 17, 2010",
        "Title": "DEVIL #2 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410662?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Torajiro Kishi (A) Torajiro Kishi",
        "SRP": "SRP: $3.50",
        "Text": "DEVIL #2 (of 4)<br/> <br/> Torajiro Kishi (W/A) and Madhouse Studios (W/A)<br/> <br/> On sale Mar 17<br/> FC, 24 pages<br/> $2.99<br/> Miniseries<br/> <br/> Could there ever be such thing as a vampire virus? Sounds like the stuff of sci-fi and horror all wrapped up in one, and that's what makes Devil such an interesting story. Answers unfold about the government program that created this nasty disease of superhuman power and hunger for blood in the second frantic issue. Who is this Mariko creature? Is she a victim, or is she proud of her new, superevolved existence? And can the government really contain the beautiful monster they've created?<br/> <br/> Manga artist Torajiro Kishi (Maka-Maka) and blockbuster anime studio Madhouse (Trigun, Paprika, Ninja Scroll) love comics. So much so that they've decided to publish an original, Western-style comic exclusively with Dark Horse! Enter Devil, a thrilling, sci-fi take on the vampire genre. <br/> <br/> <br/> <br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100128",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "BARRY WINDSOR SMITH CONAN ARCHIVES HC VOL 02",
        "SRP": "SRP: $49.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Roy Thomas (A/CA) Barry Windsor-Smith",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410654?type=1",
        "Text": "Nearly forty years have passed since Barry Windsor-Smith began his historical run on Conan the Barbarian-never had anyone conveyed Conan's gigantic melancholies and great mirth in a more masterful way. Barry Windsor-Smith became the standard by which all other Conan comic-book artists have since been measured. In order to commemorate Barry Windsor-Smith's lasting legacy and honor one of the most influential Conan artists of all time, Dark Horse presents The Barry Windsor-Smith Conan Archives Volume 2. This, the second of two handsome hardcovers, collects the final half of Roy Thomas and Barry Windsor-Smith's collaboration on Conan the Barbarian and includes such classic tales as \"Red Nails\" and \"The Frost-Giant's Daughter\"! Featuring the updated colors from Dark Horse's Chronicles line, this book is a can't miss for new and old readers alike!<br/> <br/> o This volume reprints the second half of Barry Windsor-Smith's run on Conan the Barbarian and includes his adaptation of Robert E. Howard's \"Red Nails\"!<br/> <br/> o The two Barry Windsor-Smith archives collect all of the historic and influential Conan the Barbarian comics drawn by Barry Windsor-Smith!<br/> <br/> <br/> <br/> Conan © 2010 Conan Properties International LLC (\"CPI\"). CONAN, CONAN THE BARBARIAN, THE SAVAGE SWORD OF CONAN, HYBORIA, and related logos, characters, names, and distinctive likenesses thereof are trademarks or registered trademarks of CPI. All rights reserved. <br/>"
    },
    {
        "ItemCode": "JAN100127",
        "ReleaseDate": "In Shops: May 05, 2010",
        "Title": "CONAN HC VOL 08 BLACK COLOSSUS",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410945?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Timothy Truman (A) Tomas Giorello",
        "SRP": "SRP: $24.99",
        "Text": "CONAN VOLUME 8: BLACK COLOSSUS<br/> <br/> Timothy Truman (W), Tomás Giorello (A), and José Villarrubia (C)<br/> <br/> On sale May 5<br/> FC, 152 pages<br/> $24.99<br/> HC, 7\" x 10\"<br/> <br/> Conan, once a wandering thief, tries his luck as a professional warrior, joining Amalric's mercenary forces to live as a rank-and-file soldier. However, something much more than luck will lead Conan on a collision course with the strongest, strangest army he's ever faced! Princess Yasmela-the city of Khoraja's remaining sovereign-has been haunted by terrifying apparitions of the wizard Natohk, and when Natohk threatens to bring his demonic hordes to Khoraja, Yasmela prays to the god Mitra for help. Mitra actually responds and tells her to place the fate of her entire kingdom into the hands of the first man she meets out in the city streets-and that man is a drunk, hesitant barbarian! Conan may turn out to be Khoraja's best hope for survival, but his distrust of the soft upper classes and their disdain for his common station may derail any possibility of working together to halt Natohk's bid for world domination. Timothy Truman adapts Robert E. Howard's powerful \"Black Colossus\" short story and sets Conan off on what will be his bloodiest battle yet, when the mercenaries of Amalric clash with the massive powers of Natohk! <br/> <br/> o Collects Conan the Cimmerian #8-#13.<br/> <br/> o \"The artists team up to create a pitch-perfect sword and sorcery aesthetic which easily ranks the book amongst the best of comparable books on the stands.\" -ign.com<br/> <br/> Conan the Cimmerian © 2010 Conan Properties International LLC (\"CPI\"). CONAN, CONAN THE BARBARIAN, THE SAVAGE SWORD OF CONAN, HYBORIA, and related logos, characters, names, and distinctive likenesses thereof are trademarks or registered trademarks of CPI. All rights reserved. <br/> <br/>  <br/>"
    },
    {
        "ItemCode": "JAN100126",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "CONAN LEGACY FRAZETTA COVER #4 ",
        "SRP": "SRP: $6.99",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Mike Mignola (A) Cary Nord (CA) Frank Frazetta",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410659?type=1",
        "Text": "CONAN: THE FRAZETTA COVER SERIES #4<br/> <br/> Mike Mignola (W), Cary Nord (P), Dave Stewart (C), and Frank Frazetta (Cover)<br/> <br/> On sale Mar 10<br/> FC, 48 pages<br/> $5.99<br/> Ongoing<br/> <br/> The fourth installment in Conan: The Frazetta Cover Series features Frank Frazetta's stunning painting, \"The Destroyer,\" and includes an adaptation of \"The Hall of the Dead\"-an unfinished tale left by Robert E. Howard and fleshed out by Mike Mignola, Cary Nord, and Dave Stewart.<br/> <br/> Pursued by a small army, Conan heads for shelter in the ancient ruins of a forgotten city, lured by a flimsy rumor of treasure. Instead, he finds the fallen idols of twisted gods and a lot of croaking creatures. Luckily, frogs are no match for an armed Cimmerian . . . right? Conan soon finds himself battling a slithering monstrosity and an onslaught of undead warriors! Retainers to a lord long forgotten awaken to protect a treasure so sizable even the dead can't bear to see it stolen. Can a cunning Cimmerian and a foe-turned-ally withstand the power of such dark sorceries long enough to escape with some loot and their lives?<br/> <br/> <br/> Conan the Cimmerian © 2010 Conan Properties International LLC (\"CPI\"). CONAN, CONAN THE BARBARIAN, THE SAVAGE SWORD OF CONAN, HYBORIA, and related logos, characters, names, and distinctive likenesses thereof are trademarks or registered trademarks of CPI. All rights reserved. <br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100125",
        "ReleaseDate": "In Shops: Apr 28, 2010",
        "Title": "CONAN THE CIMMERIAN #20 KOZAKI PT 2 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410660?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Timothy Truman (A) Tomas Giorello (CA) Cary Nord",
        "SRP": "SRP: $2.99",
        "Text": "CONAN THE CIMMERIAN #20: KOZAKI part 2 (of 3)<br/> <br/> Timothy Truman (W), Tomás Giorello (A), José Villarrubia (C), and Cary Nord (Cover)<br/> <br/> On sale Mar 24<br/> FC, 40 pages<br/> $2.99<br/> Ongoing <br/> <br/> In part two of \"Kozaki,\" both Sergius the pirate and the sadistic Shah Amurath decide to confront Conan's group of bandits, who are encroaching upon their territories and threatening the outlying granaries, farms, and villages of the proud country of Turan. King Yildiz quickly orders the Shah to annihilate all Kozaki riders, and Sergius arranges a parley with our favorite Cimmerian. In a tense meeting, Sergius explains how commerce works around the Vilayet Sea and offers that their two imposing forces work together against the Shah. With those in Conan's hungry crew growing wild and impatient, Conan's not even sure how long he can keep his own men together-but he'll slit the throat of any who try to defect!<br/> <br/> <br/> \"Best New Series of 2008\" -Wizard magazine<br/> <br/> \"...writer Tim Truman is a perfect choice to adapt the oeuvre of Robert E. Howard into comics form.\" - Comics Buyer's Guide<br/> <br/> Cover by Cary Nord and Dave Stewart!!<br/> <br/> <br/> Conan the Cimmerian © 2010 Conan Properties International LLC (\"CPI\"). CONAN, CONAN THE BARBARIAN, THE SAVAGE SWORD OF CONAN, HYBORIA, and related logos, characters, names, and distinctive likenesses thereof are trademarks or registered trademarks of CPI. All rights reserved. <br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100124",
        "ReleaseDate": "In Shops: Mar 10, 2010",
        "Title": "SOLOMON KANE DEATHS BLACK RIDERS #3 ",
        "SRP": "SRP: $3.50",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Scott Allie (A) Mario Guevara (CA) Darick Robertson",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410666?type=1",
        "Text": "SOLOMON KANE: DEATH'S BLACK RIDERS #3 (of 4)<br/> <br/> Scott Allie (W), Mario Guevara (P), Juan Ferreyra (C), and Darick Robertson (Cover)<br/> <br/> On sale Mar 10<br/> FC, 32 pages<br/> $3.50<br/> Miniseries<br/> <br/> When you're trapped inside an inn that's been the scene of multiple murders and is now surrounded by a pack of evil, gruesome demons, the last thing you want to find out is that there's something equally gruesome trapped inside with you! Solomon Kane and a frightened priest may not live through the night! One will rely on his guts and guile, while the other will feel that consecrating the building with prayer will be enough to protect them. The Cleft Skull tavern seems to attract the deadliest sort of troubles Germany's Black Forest can offer-and the dangers found within and without the Cleft Skull threaten to destroy our strange hero and his frightened, new companion! Scott Allie (The Devil's Footprints, Exurbia) expands upon Robert E. Howard's classic Solomon Kane tale \"Rattle of Bones\" and the unfinished \"Death's Black Riders\" fragment, as Mario Guevara (Lone Ranger and Tonto) and Juan Ferreyra (Rex Mundi, Small Gods) join him to illustrate another horror-tinged adventure.<br/> <br/> o Covers by Darick Robertson! <br/> <br/> \"Solomon Kane is a welcome addition to the other excellent Howard properties produced by Dark Horse...\" -Comics Bulletin<br/> <br/> <br/> Solomon Kane: Death's Black Riders © 2010 Solomon Kane Inc. (\"SKI\"). SOLOMON KANE, and related logos, characters, names, and distinctive likenesses thereof are trademarks or registered trademarks of SKI. All rights reserved.<br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100123",
        "ReleaseDate": "In Shops: Mar 31, 2010",
        "Title": "TERMINATOR #1 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410974?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Zack Whedon (A) Andy MacDonald (CA) Massimo Carnevale",
        "SRP": "SRP: $3.50",
        "Text": "THE TERMINATOR #1 (of 3)<br/> <br/> Zack Whedon (W), Andy MacDonald (A), Dan Jackson (C), and Massimo Carnevale (Cover)<br/> <br/> On sale Mar 31<br/> FC, 40 pages<br/> $3.50<br/> Miniseries<br/> <br/> The year is 2029. It's the year that John Connor, leader of the Resistance, sends Kyle Reese to 1984 to save Sarah Connor from a T-800 with a grudge. <br/> <br/> But before all of that happened, Kyle Reese was just another man fighting to survive in a world overrun by a technology that had taken on a life of its own and annihilated civilization. <br/> <br/> Who was Kyle before he met John Connor and was thrust through time to face off with a T-800 and fall for a waitress with a destiny? And who were his comrades in arms? <br/> <br/> In this three-issue series we'll meet Kyle Reese and his closest allies as they take on T-600s, T-800s, and HKs, in a world where there is little in the way of food, water, or hope.<br/> <br/> Written by Zack Whedon!<br/> <br/> <br/> T1, THE TERMINATOR, ENDOSKELETON, and any depiction of Endoskeleton are trademarks of StudioCanal Image S.A.  All Rights Reserved. Copyright: © 2007, 2010 StudioCanal Image S.A. ® All Rights Reserved.<br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100073",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "GUILD #1 ",
        "SRP": "SRP: $3.50",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Felicia Day (A) Jim Rugg (CA) Georges Jeanty",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410973?type=1",
        "Text": "THE GUILD #1 (of 3)<br/> <br/> Felicia Day (W), Jim Rugg (A), Dan Jackson, Georges Jeanty (Cover), and Cary Nord (Cover)<br/> <br/> On sale Mar 24<br/> FC, 32 pages<br/> $3.50<br/> Miniseries<br/> <br/> Internet phenomenon The Guild comes to comics, courtesy of series creator, writer, and star Felicia Day (Dr. Horrible's Sing-Along Blog)!<br/> <br/> Chronicling the hilarious on- and offline lives of a group of Internet role-playing gamers, the Knights of Good, The Guild has become a cult hit and is the winner of numerous awards from SXSW, YouTube, Yahoo, and the Streamys. Now Day brings the wit and heart of the show to this three-issue miniseries. In this origin tale of the Knights of Good, we learn about Cyd's life before joining the guild, how she became Codex, and how she began to meet the other players who would eventually become her teammates. This storyline fills in details never before revealed on the web show, making it a delightful new chapter for existing fans as well as a perfect jumping-on point for new fans!<br/> <br/> o The Guild is \"perhaps the smartest (and definitely the funniest) webisodic series of the year.\"<br/> -The Los Angeles Times <br/> <br/> o The web series is the winner of three 2009 Streamy Awards: Best Comedy Web Series, Best Ensemble, and Best Actress for Felicia Day.<br/> <br/> o See the web series at watchtheguild.com.<br/> <br/> <br/> The internet phenomenon The Guild comes to comics!<br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100072",
        "ReleaseDate": "In Shops: Mar 24, 2010",
        "Title": "GUILD #1 ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410972?type=1",
        "Publisher": "DARK HORSE COMICS",
        "Creators": "(W) Felicia Day (A) Jim Rugg (CA) Georges Jeanty",
        "SRP": "SRP: $3.50",
        "Text": "THE GUILD #1 (of 3)<br/> <br/> Felicia Day (W), Jim Rugg (A), Dan Jackson, Georges Jeanty (Cover), and Cary Nord (Cover)<br/> <br/> On sale Mar 24<br/> FC, 32 pages<br/> $3.50<br/> Miniseries<br/> <br/> Internet phenomenon The Guild comes to comics, courtesy of series creator, writer, and star Felicia Day (Dr. Horrible's Sing-Along Blog)!<br/> <br/> Chronicling the hilarious on- and offline lives of a group of Internet role-playing gamers, the Knights of Good, The Guild has become a cult hit and is the winner of numerous awards from SXSW, YouTube, Yahoo, and the Streamys. Now Day brings the wit and heart of the show to this three-issue miniseries. In this origin tale of the Knights of Good, we learn about Cyd's life before joining the guild, how she became Codex, and how she began to meet the other players who would eventually become her teammates. This storyline fills in details never before revealed on the web show, making it a delightful new chapter for existing fans as well as a perfect jumping-on point for new fans!<br/> <br/> o The Guild is \"perhaps the smartest (and definitely the funniest) webisodic series of the year.\"<br/> -The Los Angeles Times <br/> <br/> o The web series is the winner of three 2009 Streamy Awards: Best Comedy Web Series, Best Ensemble, and Best Actress for Felicia Day.<br/> <br/> o See the web series at watchtheguild.com.<br/> <br/> <br/> The internet phenomenon The Guild comes to comics!<br/>\n<br/>"
    },
    {
        "ItemCode": "JAN100065",
        "ReleaseDate": "In Shops: Feb 24, 2010",
        "Title": "MARVEL PREVIEWS MARCH 2010 EXTRAS",
        "SRP": "SRP: $1.25",
        "Publisher": "MARVEL COMICS (BUY - SELL)",
        "Creators": "(CA) Ed McGuinness, John Romita",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411435?type=1",
        "Text": "Your Marvel companion piece to the regular issue of PREVIEWS!<br/> Each issue of Marvel Previews is a comic book-sized, 120-page, full-color guide and preview to all of Marvel's upcoming releases - it's your #1 source for advanced information on Marvel Comics! This March issue features items scheduled to ship in May 2010 and beyond.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100034",
        "Title": "FCBD 2010 ARTIFACTS #0",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411034?type=1",
        "Publisher": "IMAGE / TOP COW                         ",
        "Creators": "(W) Ron Marz (A) Top Cow's Finest (CA) Stjepan Sejic",
        "SRP": "SRP: PI",
        "Text": "Building on the success of First Born and Broken Trinity, Top Cow finally reveals the secrets of all 13 Artifacts, which include The Darkness, Witchblade, Angelus, Magdalena's Spear of Destiny, and many more. Launching a massive 13 issue event series in July 2010, this series will literally define and redefine the nature of the Top Cow Universe. The final identity of the remaining hidden Artifacts will be revealed, characters will perish, and the very existence of the Top Cow Universe will be at stake. And it begins here!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100033",
        "Title": "FCBD 2010 OWLY & FRIENDS",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411033?type=1",
        "Publisher": "IDW - TOP SHELF",
        "Creators": "(W) Various (A/CA) Various",
        "SRP": "SRP: PI",
        "Text": "by Andy Runton, James Kochalka, &amp; Christian Slade. <br/>  <br/> Top Shelf is proud to join the 2010 FREE COMIC BOOK DAY celebration with not one, but THREE all-ages tales. In this FCBD edition, we'll not only present an all-new OWLY adventure by Andy Runton, but also two other all-new, all-ages adventures from Owly's friends: JOHNNY BOO by James Kochalka &amp; KORGI by Christian Slade.<br/> Perfect for everyone in the family. With a great cover by Christian Slade this time around. <br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100032",
        "Title": "FCBD 2010 STUFF OF LEGEND & MORTAL INSTRUMENTS",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410519?type=1",
        "Publisher": "TH3RD WORLD STUDIOS",
        "Creators": "(W) Various (A) Various (CA) Charles Paul Wilson",
        "SRP": "SRP: PI",
        "Text": "Did you miss out on the book Comic Book Resources called one of the surprise hits of 2009? Don't be left in The Dark this year as Th3rd World Studios presents not only a recap of the toys' first adventure from Volume I, The Dark, but also a first look at Volume 2, The Jungle set to launch in June.  Also, get an exclusive look at the first chapter of Th3rd World's adaptation of the New York Times Bestselling novel, The Mortal Instruments, City of Bones, by Cassandra Clare. This young adult fantasy series centers on the life of fifteen-year-old Clary Fray and her discovery of a bizarre unseen world filled with Shadowhunters, a secret tribe of warriors dedicated to ridding the earth of demons.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100031",
        "Title": "FCBD 2010 STORM LION",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410522?type=1",
        "Publisher": "STORM LION LLC",
        "Creators": "(W) Various (A) Various (CA) Puppeteer Lee",
        "SRP": "SRP: PI",
        "Text": "Metal twisting tales of the meanest, fastest mechs in all-out heart-pounding action, the legend of the Freedom Formula races starts here in this collection of must-read stories. Spinning out of last year's acclaimed mini-series and soon to be a major motion picture from New Regency with Bryan Singer (Superman Returns).<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100030",
        "Title": "FCBD 2010 ATOMIC ROBO AND FRIENDS",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410524?type=1",
        "Publisher": "RED 5 COMICS",
        "Creators": "(W) Brian Clevinger (A/CA) Scott Wegener",
        "SRP": "SRP: PI",
        "Text": "Eisner-nominated ATOMIC ROBO knows that the rain forests of South America hid many secrets, but not as deadly as The Terror Bird! Forgotten by time, these prehistoric apex predators are primed to devastate the modern world! The word \"terror\" is right there in its name. Plus, previews of 2010 adventures of Red 5 favorites and new faces.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100029",
        "Title": "FCBD 2010 RADICAL BIGGER BOOKS BIGGER VALUE",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410525?type=1",
        "Publisher": "RADICAL PUBLISHING",
        "Creators": "(W) Various (A) Various",
        "SRP": "SRP: PI",
        "Text": "Wesley Snipes (Blade) and award winning director Antoine Fuqua (Training Day) join acclaimed writer Peter Milligan (Skreemers, X-Statix) and artist Jeff Nentrup to create the science fiction saga After Dark; Next, Jimmy Palmiotti and Justin Gray, the team behind Jonah Hex, deliver a trapped-in-time adventure set to explode with Time Bomb, featuring illustrations from award-winning comic legend Paul Gulacy (Batman: Legends of the Dark Knight); Driver for the Dead will keep your heart racing with a tale of action, horror and voodoo from Snakes on a Plane scribe John Heffernan; Finally, Radical presents  Spartacus for the future world, The Rising, from creator/writer E. Max Frye (HBO's Band of Brothers) and artist J.P. Targete (illustrator for Pixar's John Carter of Mars film adaptation).<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100028",
        "Title": "FCBD 2010 SIXTH GUN #1",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410523?type=1",
        "Publisher": "ONI PRESS INC.",
        "Creators": "(W) Cullen Bunn (A/CA) Brian Hurtt",
        "SRP": "SRP: PI",
        "Text": "During the darkest days of the Civil War, wicked cutthroats came into possession of six pistols of otherworldly power. In time, the Sixth Gun-the most dangerous of the weapons-vanished. When the gun surfaces in the hands of an innocent girl, dark forces reawaken. Vile men thought long dead set their sights on retrieving the gun and killing the girl. Only Drake Sinclair, a gunfighter with a shadowy past, stands in their way.<br/> The Sixth Gun is a two-fisted adventure set in the mysterious and supernatural corners of the old west.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100027",
        "Title": "FCBD 2010 ONI PRESS FREE FOR ALL",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410521?type=1",
        "Publisher": "ONI PRESS INC.",
        "Creators": "(W) Various (A) Various",
        "SRP": "SRP: PI",
        "Text": "Coming your way this Free Comic Book Day: the Oni Press Free For All! This all-ages anthology packs in three exclusive terrific tales from The Crogan Adventures by Chris Schweizer, Salt Water Taffy by Matthew Loux and the all new series Possessions by Ray Fawkes!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100026",
        "Title": "FCBD 2010 TICK #1 SPECIAL EDITION",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410520?type=1",
        "Publisher": "NEW ENGLAND COMICS",
        "Creators": "(W) Ben Edlund (A/CA) Ben Edlund",
        "SRP": "SRP: PI",
        "Text": "In honor of this year's FREE COMIC BOOK DAY, and to commemorate the first appearance of The Tick 24 years ago, NEC Press offers this special re-presentation of Ben Edlund's legendary first issue of THE TICK, in a special FREE COMIC BOOK DAY SPECIAL EDITION! The complete original first comic book appearance of The Tick, as it originally hit the stands in 1986!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100025",
        "Title": "FCBD 2010 IRON MAN SUPERNOVA",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410127?type=1",
        "Publisher": "MARVEL COMICS (BUY - SELL)",
        "Creators": "(W) Paul Tobin (A) Craig Rousseau (CA) Ed McGuinness",
        "SRP": "SRP: PI",
        "Text": "(W) Paul Tobin (A) Craig Rousseau (C) Ed McGuinness<br/> What happens when an armored billionaire teams up with a hot-headed, cosmic-powered teen to fight a trio of massively-powered super-apes?  Find out when Iron Man and Nova take on Red Ghost and The Super-Apes!  Out-numbered, the Golden Avenger and the Human Rocket will have to trust an apparent traitor in the gorillas' midst if they are to survive and save an entire city.  Will they succeed or are they being played?  Find out in this all-new, action-packed adventure, which happens to be FREE!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100024",
        "Title": "FCBD 2010 LOVE & CAPES #13",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411336?type=1",
        "Publisher": "MAERKLE PRESS",
        "Creators": "(W) Thomas F. Zahler (A/CA) Thomas F. Zahler",
        "SRP": "SRP: PI",
        "Text": "The wedding and the honeymoon are over for comicdom's favorite super couple, so what's next? Getting settled, starting their new life... and finding out what really happened at the reception. <br/> It's a whole new start for \"Love and Capes\", and a great lead-in to the second trade coming from IDW in summer 2010.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100023",
        "Title": "FCBD 2010 LIBRARY OF AMERICAN COMICS #0",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410994?type=1",
        "Publisher": "IDW PUBLISHING                          ",
        "Creators": "(W) Various (A/CA) Various",
        "SRP": "SRP: PI",
        "Text": "Presenting excerpts from the greatest comic strips of all time, from action/adventure to high drama, to fall-on-the-floor hilarious. IDW and the Library of American Comics present 32 pages of previews from upcoming volumes including Archie by Bob Montana, Secret Agent Corrigan by Al Williamson, Blondie by Chic Young, The Complete Bloom County Library by Berkeley Breathed, Rip Kirby by Alex Raymond, Polly and Her Pals by Chris Sterrett, Dick Tracy by Chester Gould, and Little Orphan Annie by Harold Gray.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100022",
        "Title": "FCBD 2010 OVERSTREET GUIDE TO COLLECTING COMICS",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411348?type=1",
        "Publisher": "GEMSTONE PUBLISHING",
        "Creators": "(W) Robert M. Overstreet, J. C. Vaughn (A) Gene Gonzales, Various (CA) Brendon Fraim, Brian Fraim",
        "SRP": "SRP: PI",
        "Text": "How do you collect comics? How do you take care of the comics you buy? How do you grade comics? How do you sell your comics? How do you evaluate their worth? The Overstreet Comic Book Price Guide answers the questions and more facing new collectors and experienced enthusiasts alike!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100021",
        "Title": "FCBD 2010 WEATHERCRAFT  ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411333?type=1",
        "Publisher": "FANTAGRAPHICS BOOKS",
        "Creators": "(W) Jim Woodring (A/CA) Jim Woodring",
        "SRP": "SRP: PI",
        "Text": "Are you ready? Because your life is about to change! Perception as you know it will cease! Fantagraphics is very proud to present Jim Woodring's WEATHERCRAFT for FCBD 2009. Every other free comic book will pale in comparison to our powerful and supernatural print-barge for both the enlightened and perplexed masses. Marvel at the toothy preview of Jim Woodring's first original graphic novel, do your detective work with exclusive behind the scenes interviews, and gasp at rare out of print images, comics and transmissions all from Jimland! Beware! Manhog lurks near...<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100020",
        "Title": "FCBD 2010 GREEN HORNET",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410737?type=1",
        "Publisher": "D. E.                                   ",
        "Creators": "(W) Kevin Smith (A) Jonathan Lau (CA) Alex Ross",
        "SRP": "SRP: PI",
        "Text": "<i>(W) Kevin Smith (A) Jonathan Lau<br/> </i>Dynamite Entertainment proudly presents the return of the Green Hornet! In 2010, Dynamite will unveil three brand-new <i>Green Hornet</i> series, starting with the world-wide debut of Kevin Smith's vision for the masked crusader (from his never-before-seen and unproduced screenplay).  Dynamite is going to pull all of the stops to get mainstream attention for this series so that more civilians are aware and will hopefully come to your store for their copy. NEVER underestimate the power of Kevin Smith's name!  Also, the entire story is in from Kevin Smith and this series will ship on time! Get a first-look as part of this year's Free Comic Book Day with this special edition featuring not only Smith's version, but the award winning work of creators Matt Wagner and Brett Matthews as well! All in one FREE comic event!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100019",
        "Title": "FCBD 2010 DEL REY SHOWCASE",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410759?type=1",
        "Publisher": "RANDOM HOUSE",
        "Creators": "(W) Various (A) Various",
        "SRP": "SRP: PI",
        "Text": "<br/> Featuring previews of Del Rey's upcoming comics and graphic novels including: The Last Airbender by Dave Roman, Alison Wilgus, and Nina Matsumoto; The Talisman: A Collision of Worlds by Stephen King, Peter Straub, and Tony Shasteen; Odd is On Our Side by Dean Koontz, Fred Van Lente, and Queenie Chan; Pride, Prejudice, and Zombies: The Graphic Novel by Jane Austen, Seth Grahame-Smith, Tony Lee, and Cliff Richards<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100017",
        "Title": "FCBD 2010 IRREDEEMABLE #1  ",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410996?type=1",
        "Publisher": "BOOM! STUDIOS                           ",
        "Creators": "(W) Mark Waid (A) Peter Krause (CA) John Cassaday",
        "SRP": "SRP: PI",
        "Text": "Last year's comic book industry event is this year's best way to get more readers for Mark Waid's bestselling original title IRREDEEMABLE. Here's your chance to give the sold-out first issue of IRREDEMEEMABLE free to all your customers and get them hooked on the critically acclaimed series that has captivated fans across the globe! IRREDEEMABLE dared to ask the question: what if the world's greatest hero decided to become the world's greatest villain? And twelve issues later that question has been answered with a bestselling comic series, two bestselling trade collections and INCORRUPTIBLE, the companion series. From Mark Waid, the writer of KINGDOM COME and EMPIRE!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100016",
        "Title": "FCBD 2010 BONGO COMICS FREE FOR ALL",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411032?type=1",
        "Publisher": "BONGO COMICS",
        "Creators": "(W) Various (A/CA) Various",
        "SRP": "SRP: PI",
        "Text": "The comic company that brings you The Simpsons and Futurama in the fantastic four-color format joins with retailers to reel in new readers, with a comic cornucopia of tantalizing tidbits and a spectacular sampling of the best in humor comics.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100014",
        "Title": "FCBD 2010 FEARLESS DAWN ASYLUM PRESS SAMPLER",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410740?type=1",
        "Publisher": "ASYLUM PRESS",
        "Creators": "(W) Frank Forte, Steve Mannion (A/CA) Steve Mannion",
        "SRP": "SRP: PI",
        "Text": "A great way to introduce Asylum Press to retailers and fans, featuring a sampling of new and upcoming comics.  Fearless Dawn, by Steve Mannion, features our favorite new heroine battling a troop of mutants.  Black Powder, a bloody frontier adventure by Dwayne Harris, can be described as a \"Buckin Apocalypse Now\".  Warlash: Origins features a tale of Bladeviper by Royal McGraw and J.C. Wong. Farmhouse is a tale of a drifter who falls in love with an artist undergoing an experimental art therapy regimen, by Elizabeth J. Musgrave and Szymon Kudranski.  In Warlash: Zombie Mutant Genesis, our armored hero goes up against a horde of brain eating monsters, by Frank Forte.  EEEK! by Jason Paulos, is an anthology of retro style horror tales.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100013",
        "Title": "FCBD 2010 WORLDS OF ASPEN",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410652?type=1",
        "Publisher": "ASPEN MLT INC",
        "Creators": "(W) Various (CA) Michael Turner (A/CA) Various",
        "SRP": "SRP: PI",
        "Text": "A special compilation issue featuring four exciting outtakes from several of Aspen's hottest titles including Soulfire (Vol 2), and Executive Assistant: Iris! Also showcased are two of Aspen's newest titles, Fathom: Blue Descent and Mindfield!  Featuring a brand new 8 page original Fathom story by new Fathom: Blue Descent artist Scott Clark!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100012",
        "Title": "FCBD 2010 SONIC THE HEDGEHOG HIDE SEEK DESTROY #1",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK409955?type=1",
        "Publisher": "ARCHIE COMIC PUBLICATIONS",
        "Creators": "(W) Ian Flynn (A) Jim Amash, James W. Fry (CA) Jason Jensen, Tracy Yardley",
        "SRP": "SRP: PI",
        "Text": "SCRIPT: Ian Flynn.  ART: James Fry (pencils) and Jim Amash (inks).<br/> <br/> <br/> \"Hide &amp; Seek &amp; DESTROY!\": Dr. Eggman has vanished-or has he? As Sonic searches for clues, he stumbles across an old weapon from the bygone days of his childhood.  Will Dr. Eggman allow Sonic to be destroyed by this threat from yesteryear? Will Sonic discover the truth behind his old rival's disappearance? All the answers lie in this free issue!  <br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100011",
        "Title": "FCBD 2010 IRON MAN THOR",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410128?type=1",
        "Publisher": "MARVEL COMICS (BUY - SELL)",
        "Creators": "(W) Matt Fraction (A/CA) John Romita",
        "SRP": "SRP: PI",
        "Text": "(W) Matt Fraction (A/C) John Romita, Jr.<br/> The perfect jumping-on point for any and all readers... and it's FREE! When rogue mega-billionaires with world-destroying technology threaten the safety of the entire world... and the moon... Thor and Iron Man join forces!  In time for the exciting launch of new stories and a bold new direction for Invincible Iron Man and Thor, superstars Matt Fraction and John Romita Jr. team up to bring you two of Marvel's heaviest hitters like you've never seen them before!  A major new direction for the Marvel Universe kicks off HERE - on Free Comic Book Day!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100010",
        "Title": "FCBD 2010 FRACTURED FABLES",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411035?type=1",
        "Publisher": "IMAGE COMICS                            ",
        "Creators": "(W) Various (A) Various (CA) Laura Allred, Mike Allred",
        "SRP": "SRP: PI",
        "Text": "Writers: Bryan Talbot, Doug TenNapel, Alexander Grecian, Derek McCulloch, Ted McKeever<br/> Artists: Camilla d'Errico, Doug TenNapel, Christian Ward, Anthony Peruzzo, Ted McKeever<br/> <br/> This special FCBD offering will give both retailers and fans a small taste of the new hardcover anthology from Silverline Books due later in the year. An all-star cast of writers and artists have been assembled to turn familiar fairy tales and nursery rhymes on the ear to make kids LAUGH! These humorous intrpretations will delight any reader, regardless their age!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100009",
        "Title": "FCBD 2010 GI JOE A REAL AMERICAN HERO #155 1/2",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410993?type=1",
        "Publisher": "IDW PUBLISHING                          ",
        "Creators": "(W) Larry Hama (A/CA) Agustin Padilla",
        "SRP": "SRP: PI",
        "Text": "It's free, it's awesome, and it's ALL-NEW! Picking up from where the ORIGINAL G.I. JOE: A REAL AMERICAN HERO comic book ended, issue #155-1/2 is a core fan's dream come true! Featuring spectacular art from Agustin Padilla, Larry Hama continues his classic G.I. JOE run right here, and RELAUNCHES THE ORIGINAL SERIES!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100008",
        "Title": "FCBD 2010 YOW THE JOHN STANLEY LIBRARY",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410992?type=1",
        "Publisher": "DRAWN & QUARTERLY",
        "Creators": "(W) John Stanley (A) John Stanley (CA) Seth",
        "SRP": "SRP: PI",
        "Text": "D+Q delivers another wholly original and boisterous FCBD issue that will entertain your newest customers and diehard fans of all ages.  The best value for your FCBD budget -as it is sure to please the widest audience possible-is undoubtedly YOW! The John Stanley Library spotlighting the world's greatest all ages cartoonist, John Stanley, and one of today's best contemporary cartoonists and designers, Seth, who will design another strikingly gorgeous FCBD cover. YOW! will feature new stories from the John Stanley Library: Melvin Monster, Nancy and 13 Going On 18. Excitedly, YOW! will also showcase a story from the legendary one-shot Choo Choo Charlie and --get this-- a story with the iconic character Tubby from his offshoot solo series from Little Lulu!  Like all of D+Q's previous FCBD issues, YOW!  is sure to garner maximum exposure in mainstream media, is directly tied to the John Stanley Library available for retailers to sell, and perhaps may be the only FCBD issue to truly capture the festivity of FCBD while showcasing the talent and accessibility of the comic book medium.  Talk about added value.<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100007",
        "Title": "FCBD 2010 WAR OF THE SUPERMEN #0",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK411557?type=1",
        "Publisher": "DC COMICS",
        "Creators": "(W) James Robinson (A) Eddy Barrows, Ruy Jose (CA) J. G. Jones",
        "SRP": "SRP: PI",
        "Text": "(W) James Robinson (A) Eddy Barrows, Ruy José<br/> (C) J.G. Jones<br/> A war is coming, and all that stands between Earth and 100,000 vengeful supermen is one Superman! The conflict between Superman and General Zod erupts into all-out war this summer in a series that will shatter the worlds of Superman, Supergirl and the entire DC Universe - all brought to you by the hit creative team of James Robinson and Eddy Barrows! This special #0 issue featuring all-new material previews the conflicts to come while spotlighting a savage strike on Metropolis and the world - an attack that will shake Superman to his very core. After this, there's no turning back - the War of the Supermen is here!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100006",
        "Title": "FCBD 2010 DOCTOR SOLAR MAGNUS ROBOT HUNTER",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410564?type=1",
        "Publisher": "DARK HORSE COMICS                       ",
        "Creators": "(W) Jim Shooter (A) Dennis Calero, Various",
        "SRP": "SRP: PI",
        "Text": "Doctor Solar, Man of the Atom/Magnus, Robot Fighter<br/> <br/> (W) Jim Shooter (A) Dennis Calero, and Various<br/> <br/> The dawn of a new age of superhero excitement begins on Free Comic Book Day as Dark Horse Comics proudly presents the return of two of the most legendary characters in the annals of comics, Doctor Solar, Man of the Atom and Magnus, Robot Fighter, re-imagined for the 21st century by another comics legend, writer Jim Shooter! This FCBD extravaganza offers all-new Solar and Magnus stories, each heralding new series launches in Summer of 2010, and features interior art by fan-favorite Dennis Calero (X-Men Noir) and cover art by Raymond Swanland . <br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100005",
        "Title": "FCBD 2010 TOY STORY",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410995?type=1",
        "Publisher": "BOOM! STUDIOS                           ",
        "Creators": "(A/CA) Nathan Watson",
        "SRP": "SRP: PI",
        "Text": "With TOY STORY 3 hitting theaters this Summer, don't miss this opportunity to get kids hooked on comics with a free issue from the ongoing TOY STORY series from BOOM Kids! More all-new adventures featuring the world's favorite toys with Woody, Buzz and the gang!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100004",
        "Title": "FCBD 2010 MOUSE GUARD FRAGGLE ROCK FLIP BOOK",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410645?type=1",
        "Publisher": "ARCHAIA ENTERTAINMENT LLC",
        "Creators": "(W) David Petersen, Various (A/CA) David Petersen, Various",
        "SRP": "SRP: PI",
        "Text": "Archaia is proud to present two amazing all-new stories in one fantastic flip book--David Petersen's award-winning MOUSE GUARD and Jim Henson's beloved FRAGGLE ROCK share the spotlight on Free Comic Book Day!  In the spring of 1153 the Mouse Guard deal with the onset of the spring thaw and the havoc it wreaks on their territories. As they scatter to clean, and hunt, and glean, they also search for their missing redfur... Meanwhile, it's time to dance your cares away as Archaia and The Jim Henson Company invite you to return to FRAGGLE ROCK. Join Gobo, Mokey, Wembley, Boober and Red for a brand-new series of hilarious and heartfelt adventures written and drawn by some of the most imaginative creators in comics. Whether you're a fan of the original series or new to the world of the Fraggles, this is one title you don't want to miss!<br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 14, 2010",
        "ItemCode": "JAN100003",
        "Title": "FCBD 2010 ARCHIES SUMMER SPLASH",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK409951?type=1",
        "Publisher": "ARCHIE COMIC PUBLICATIONS",
        "Creators": "(W) Dan Parent (A/CA) Dan Parent",
        "SRP": "SRP: PI",
        "Text": "SCRIPT AND ART: Dan Parent.<br/> <br/> \"Whose BEACH is it Anyway?\": Sun, sand, swimsuits and cool rockin' tunes - no, it's not a cinematic \"beach party\" blast from the past, but a whole new summer splash from Archie and his friends!  In this fun-filled free issue, Cheryl and her snooty friends from Pembrooke form an all-girl group to compete head on with the Archies at a summer beach music festival.  Will Cheryl's group be a tuneful treat, or mistaken for bellowing whales?  <br/>"
    },
    {
        "ReleaseDate": "In Shops: Apr 21, 2010",
        "ItemCode": "JAN100002",
        "Title": "FCBD 2010 KIZOIC SHREK & PENGUINS OF MADAGASCAR",
        "mainContentImage": "http://www.previewsworld.com/SiteImage/CatalogImage/STK410734?type=1",
        "Publisher": "APE ENTERTAINMENT",
        "Creators": "(W) Various (A/CA) Various",
        "SRP": "SRP: PI",
        "Text": "Ape Entertainment proudly offers \"KiZOIC Presents: Shrek\" and \"KiZOIC Presents: Penguins of Madagascar\".  Featuring four stories by the artists and writers of the up-coming \"Shrek\" and \"Penguins of Madagascar\" comic books, these stories are guaranteed to tickle your funny bone and leave you begging for more! All ages fun for everyone!<br/>"
    }
]